{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. /*************************************
> Last Modified: 11/8
> Author: Alex Kaufman
> Changes Made: Corrected growth variables, added tile info, other tweaks
> 
> NOTE: Users will need to change the file location of the data set being read in
> 
> If the Rdplot command is failing, run the following command
> net install rdrobust, from(https://sites.google.com/site/rdpackages/rdrobust/stata) replace
> 
> For info on the Rdplot function (how to change things on the graphs)
> http://fmwww.bc.edu/repec/bocode/r/rdplot.html
> 
> *************************************/
. 
. 
. 
. 
. 
. *CHANGE THE FILE LOCATION BELOW TO WHERE YOUR DATA IS
. use "\\files\ak29\ClusterDownloads\Commercial_imperialism_old.dta", clear
{txt}
{com}. 
. **CHANGE THE FILE LOCATIONS BELOW TO WHERE YOU WANT TO SAVE YOUR GRAPHS
. cd "\\Files\ak29\GitHub\WWS_class"
{res}\\Files\ak29\GitHub\WWS_class
{txt}
{com}. 
. *cleaning commands
. count if year_after_onset > 0 & USinfluence == 0 & US_install_and_support  == 0 & US_support_only == 0
  {res}0
{txt}
{com}. *create trend variable
. local influence USinfluence
{txt}
{com}. 
. *creat a variable that indicates the instance of influence intervention
. gen new_intervention = 0
{txt}
{com}. replace new_intervention = 1 if `influence' == 1 & `influence'[_n-1] != 1 & `influence'[_n-2] != 1 & country[_n-1] == country[_n]
{txt}(58 real changes made)

{com}. sort country year
{txt}
{com}. bysort country: gen inc_count = sum(new_intervention)
{txt}
{com}. replace inc_count = 0 if new_intervention != 1
{txt}(1,569 real changes made)

{com}. drop new_intervention
{txt}
{com}. 
. *calcualte the distance from the first intervention (for each country)
. sort country year 
{txt}
{com}. by country: gen c_obs = _n
{txt}
{com}. by country: gen influence_count = _n if `influence' == 1
{txt}(6,571 missing values generated)

{com}. by country: egen min_influ = min(influence_count)
{txt}(5290 missing values generated)

{com}. gen yr_from_influ1 = c_obs - min_influ
{txt}(5,290 missing values generated)

{com}. drop c_obs min_inf
{txt}
{com}. 
. *calcualte the distance from the second intervention (for each country)
. sort country year 
{txt}
{com}. by country: gen c_obs = _n
{txt}
{com}. by country: egen second_mode = mode(influence_count) if inc_count == 2
{txt}(7629 missing values generated)

{com}. by country: egen min_influ = mode(second_mode)
{p}{txt}Warning: at least one group contains all
missing values or contains multiple modes.
Generating missing values for the mode of these
groups.  Use the {cmd: missing}, {cmd:maxmode},
{cmd:minmode}, or {cmd:nummode()}
options to control this behavior.{p_end}
(7314 missing values generated)

{com}. gen yr_from_influ2 = c_obs - min_influ
{txt}(7,314 missing values generated)

{com}. 
. *flag the end of an intervention
. gen end_flag = 0
{txt}
{com}. replace end_flag = 1 if `influence' == 0 & `influence'[_n-1] == 1 & `influence'[_n+1] != 1
{txt}(39 real changes made)

{com}. sort country year
{txt}
{com}. *create running sum of "after intervention" flag
. bysort country: gen second_int = sum(end_flag)
{txt}
{com}. 
. *create the final "distance" variable
. gen distance_from_intv = yr_from_influ1
{txt}(5,290 missing values generated)

{com}. replace distance_from_intv = yr_from_influ2 if second_int > 0
{txt}(625 real changes made, 427 to missing)

{com}. 
. *create varaibles measuring trade 
. *CLEANING TASK: figure out why some observations of intntl and US trade > 1
. gen adj_int_trade = (COW_importsWORLD + COW_exportsWORLD ) / total_gdp 
{txt}(2,981 missing values generated)

{com}. gen adj_US_trade = (COW_importsUS + COW_exportsUS ) / total_gdp
{txt}(3,042 missing values generated)

{com}. *CLEANING TASK: id outliers for nommial trade aggregates
. gen nom_int_trade = COW_importsWORLD + COW_exportsWORLD
{txt}(2,355 missing values generated)

{com}. gen nom_US_trade = COW_importsUS + COW_exportsUS
{txt}(2,421 missing values generated)

{com}. 
. *worldwide aggregates
. bysort year: egen sum_global_int_trade = sum(nom_int_trade)
{txt}
{com}. bysort year: egen sum_global_US_trade = sum(nom_US_trade)
{txt}
{com}. bysort year: egen sum_global_gdp = sum(total_gdp)
{txt}
{com}. 
. *worldwide trade adjusted by gdp
. gen global_adj_int_trade = sum_global_int_trade / sum_global_gdp
{txt}
{com}. gen global_adj_US_trade = sum_global_US_trade / sum_global_gdp
{txt}
{com}. 
. 
. bysort year: egen global_nom_int_trade = total(nom_int_trade)
{txt}
{com}. bysort year: egen global_nom_US_trade = total(nom_US_trade)
{txt}
{com}. 
. *--------------calculate growth rates----------------------------*
. 
. 
. foreach var of varlist adj* nom* global*{c -(}
{txt}  2{com}.  
.         *create lagged variable
.         sort country year
{txt}  3{com}.         by country: gen l1_`var' = `var'[_n-1]
{txt}  4{com}. 
.         *calcualte growth rate
.         gen `var'_rough = (`var'- l1_`var') / l1_`var'
{txt}  5{com}.         
.         *trim the variable to remove extreme values
.         replace `var'_rough = . if `var'_rough > 10
{txt}  6{com}.         sum `var'_rough, detail
{txt}  7{com}.         gen `var'_growth = `var'_rough if `var'_rough <= r(p99)
{txt}  8{com}.         
.         drop *_rough
{txt}  9{com}. 
. {c )-}
{txt}(3,112 missing values generated)
(3,189 missing values generated)
(8 real changes made, 8 to missing)

                     adj_int_trade_rough
{hline 61}
      Percentiles      Smallest
 1%    {res}-.3899702             -1
{txt} 5%    {res}-.1675558             -1
{txt}10%    {res}-.0931743             -1       {txt}Obs         {res}      4,439
{txt}25%    {res}-.0043317             -1       {txt}Sum of Wgt. {res}      4,439

{txt}50%    {res} .0897653                      {txt}Mean          {res} .1418896
                        {txt}Largest       Std. Dev.     {res} .3807486
{txt}75%    {res} .2110548       5.688265
{txt}90%    {res}  .399373       5.908962       {txt}Variance      {res} .1449695
{txt}95%    {res} .5531849       7.475812       {txt}Skewness      {res} 8.745337
{txt}99%    {res} 1.227492       7.735332       {txt}Kurtosis      {res} 131.5419
{txt}(3,241 missing values generated)
(3,173 missing values generated)
(3,355 missing values generated)
(14 real changes made, 14 to missing)

                     adj_US_trade_rough
{hline 61}
      Percentiles      Smallest
 1%    {res} -.794853             -1
{txt} 5%    {res}-.3993878             -1
{txt}10%    {res}-.2588629             -1       {txt}Obs         {res}      4,267
{txt}25%    {res}-.0662727             -1       {txt}Sum of Wgt. {res}      4,267

{txt}50%    {res}  .087665                      {txt}Mean          {res} .1748492
                        {txt}Largest       Std. Dev.     {res} .6427716
{txt}75%    {res}  .265431       9.141768
{txt}90%    {res} .5700039       9.433393       {txt}Variance      {res} .4131554
{txt}95%    {res} .9380769       9.724574       {txt}Skewness      {res} 6.563717
{txt}99%    {res}  2.66941       9.841234       {txt}Kurtosis      {res} 75.34332
{txt}(3,411 missing values generated)
(2,511 missing values generated)
(2,608 missing values generated)
(10 real changes made, 10 to missing)

                     nom_int_trade_rough
{hline 61}
      Percentiles      Smallest
 1%    {res}-.4269284             -1
{txt} 5%    {res}-.1855126             -1
{txt}10%    {res}-.1096329             -1       {txt}Obs         {res}      5,018
{txt}25%    {res}-.0085048             -1       {txt}Sum of Wgt. {res}      5,018

{txt}50%    {res} .0927798                      {txt}Mean          {res} .1377816
                        {txt}Largest       Std. Dev.     {res} .4218956
{txt}75%    {res} .2061013       7.102762
{txt}90%    {res}  .372157       7.785689       {txt}Variance      {res} .1779959
{txt}95%    {res} .5182629       8.813469       {txt}Skewness      {res} 9.992134
{txt}99%    {res} 1.317307       9.133706       {txt}Kurtosis      {res} 161.1874
{txt}(2,668 missing values generated)
(2,577 missing values generated)
(2,820 missing values generated)
(18 real changes made, 18 to missing)

                     nom_US_trade_rough
{hline 61}
      Percentiles      Smallest
 1%    {res}-.8299712             -1
{txt} 5%    {res}-.4166667             -1
{txt}10%    {res}-.2713026             -1       {txt}Obs         {res}      4,798
{txt}25%    {res}-.0681009             -1       {txt}Sum of Wgt. {res}      4,798

{txt}50%    {res} .0866082                      {txt}Mean          {res} .1654437
                        {txt}Largest       Std. Dev.     {res} .6241557
{txt}75%    {res} .2571987       8.230769
{txt}90%    {res} .5416666       8.491694       {txt}Variance      {res} .3895704
{txt}95%    {res} .9431081       8.638889       {txt}Skewness      {res} 5.911964
{txt}99%    {res} 2.583333       9.390909       {txt}Kurtosis      {res} 61.32826
{txt}(2,885 missing values generated)
(166 missing values generated)
(166 missing values generated)
(166 real changes made, 166 to missing)

                 global_adj_int_trade_rough
{hline 61}
      Percentiles      Smallest
 1%    {res}-.3552725      -.3552725
{txt} 5%    {res}  -.21621      -.3552725
{txt}10%    {res}-.0828552      -.3552725       {txt}Obs         {res}      7,304
{txt}25%    {res} .0330354      -.3552725       {txt}Sum of Wgt. {res}      7,304

{txt}50%    {res}  .089875                      {txt}Mean          {res} .1117688
                        {txt}Largest       Std. Dev.     {res} .1862125
{txt}75%    {res} .1657676       .6331609
{txt}90%    {res} .3695277       .6331609       {txt}Variance      {res} .0346751
{txt}95%    {res} .4072906       .6331609       {txt}Skewness      {res} .4632698
{txt}99%    {res} .6331609       .6331609       {txt}Kurtosis      {res} 4.261796
{txt}(332 missing values generated)
(166 missing values generated)
(166 missing values generated)
(166 real changes made, 166 to missing)

                  global_adj_US_trade_rough
{hline 61}
      Percentiles      Smallest
 1%    {res} -.473559       -.473559
{txt} 5%    {res}-.2245711       -.473559
{txt}10%    {res}-.1063759       -.473559       {txt}Obs         {res}      7,304
{txt}25%    {res} .0269427       -.473559       {txt}Sum of Wgt. {res}      7,304

{txt}50%    {res} .0956087                      {txt}Mean          {res} .0899527
                        {txt}Largest       Std. Dev.     {res} .1733337
{txt}75%    {res} .1521466       .5583671
{txt}90%    {res} .3186613       .5583671       {txt}Variance      {res} .0300446
{txt}95%    {res} .3667148       .5583671       {txt}Skewness      {res}-.2468085
{txt}99%    {res} .5583671       .5583671       {txt}Kurtosis      {res} 5.158646
{txt}(332 missing values generated)
(166 missing values generated)
(166 missing values generated)
(166 real changes made, 166 to missing)

                 global_nom_int_trade_rough
{hline 61}
      Percentiles      Smallest
 1%    {res}-.4182718      -.4182718
{txt} 5%    {res}-.0635193      -.4182718
{txt}10%    {res}-.0409013      -.4182718       {txt}Obs         {res}      7,304
{txt}25%    {res} .0428274      -.4182718       {txt}Sum of Wgt. {res}      7,304

{txt}50%    {res} .1096741                      {txt}Mean          {res} .1184755
                        {txt}Largest       Std. Dev.     {res}  .169006
{txt}75%    {res} .1571991       .6462808
{txt}90%    {res} .3465898       .6462808       {txt}Variance      {res}  .028563
{txt}95%    {res} .4652374       .6462808       {txt}Skewness      {res} .3954695
{txt}99%    {res} .6462808       .6462808       {txt}Kurtosis      {res}  5.88053
{txt}(332 missing values generated)
(166 missing values generated)
(166 missing values generated)
(166 real changes made, 166 to missing)

                  global_nom_US_trade_rough
{hline 61}
      Percentiles      Smallest
 1%    {res}    -.525          -.525
{txt} 5%    {res} -.084423          -.525
{txt}10%    {res}-.0654979          -.525       {txt}Obs         {res}      7,304
{txt}25%    {res} .0385226          -.525       {txt}Sum of Wgt. {res}      7,304

{txt}50%    {res} .0910869                      {txt}Mean          {res} .0964032
                        {txt}Largest       Std. Dev.     {res} .1516499
{txt}75%    {res} .1586811       .4615878
{txt}90%    {res} .2331962       .4615878       {txt}Variance      {res} .0229977
{txt}95%    {res} .3438241       .4615878       {txt}Skewness      {res} -.928519
{txt}99%    {res} .4615878       .4615878       {txt}Kurtosis      {res}  8.30939
{txt}(332 missing values generated)

{com}. 
. *---------------calculate difference in growth rates--------------*
. *diff in adj US growth
. gen diff_adj_intl_trade = adj_int_trade_growth - global_adj_int_trade_growth
{txt}(3,241 missing values generated)

{com}. 
. *diff in adj intl growth
. gen diff_adj_US_trade = adj_US_trade_growth - global_adj_US_trade_growth
{txt}(3,412 missing values generated)

{com}. 
. *diff in total US growth
. gen diff_intl_trade = nom_int_trade_growth - global_nom_int_trade_growth
{txt}(2,668 missing values generated)

{com}. 
. *diff in total intl growth
. gen diff_US_trade = nom_US_trade_growth - global_nom_US_trade_growth
{txt}(2,886 missing values generated)

{com}. 
. 
. *twoway scatter US_trade_growth year
. 
. *run RDD on trend 
. foreach var of varlist diff* {c -(}
{txt}  2{com}.         local trade_var `var'
{txt}  3{com}.         rdplot `trade_var' distance_from_intv if -3<= distance_from_intv & distance_from_intv <= 3, p(1) graph_options( title("Effect of `influence' on Trade (`var')") ytitle("National - Global Trade Growth Rate") xtitle("years relative to `influence' onset"))
{txt}  4{com}.         graph export "`var'_p1.png", as(png) replace
{txt}  5{com}.         rdplot `trade_var' distance_from_intv if -3<= distance_from_intv & distance_from_intv <= 3, p(3) graph_options( title("Effect of `influence' on Trade (`var')") ytitle("National - Global Trade Growth Rate") xtitle("years relative to `influence' onset"))
{txt}  6{com}. 
.         graph export "`var'_p3.png", as(png) replace
{txt}  7{com}.         {c )-}
{res}
RD Plot with evenly spaced mimicking variance number of bins using spacings estimators.

{txt}{ralign 21: Cutoff c = 0}{col 22} {c |} {col 23}Left of {res}c{col 36}{txt}Right of {res}c{col 54}{txt}Number of obs  = {res}       231
{txt}{hline 22}{c +}{hline 22}{col 54}Kernel         = {res}{ralign 10:Uniform}
{txt}{ralign 21:Number of obs}{col 22} {c |} {col 23}{res}       91{col 37}      140
{txt}{ralign 21:Eff. Number of obs}{col 22} {c |} {col 23}{res}       91{col 37}      140
{txt}{ralign 21:Order poly. fit (p)}{col 22} {c |} {col 23}{res}        1{col 37}        1
{txt}{ralign 21:BW poly. fit (h)}{col 22} {c |} {col 23}{res}    3.000{col 37}    3.000
{txt}{ralign 21:Number of bins scale}{col 22} {c |} {col 23}{res}    1.000{col 37}    1.000

Outcome: diff_adj_intl_trade. Running variable: distance_from_intv.
{txt}{hline 22}{c TT}{hline 22}
{col 22} {c |} {col 23}Left of {res}c{col 36}{txt}Right of {res}c
{txt}{hline 22}{c +}{hline 22}
{ralign 21:Bins selected}{col 22} {c |} {col 23}{res}       11{col 37}       46
{txt}{ralign 21:Average bin length}{col 22} {c |} {col 23}{res}    0.273{col 37}    0.065
{txt}{ralign 21:Median bin length}{col 22} {c |} {col 23}{res}    0.273{col 37}    0.065
{txt}{hline 22}{c +}{hline 22}
{ralign 21:IMSE-optimal bins}{col 22} {c |} {col 23}{res}        1{col 37}        7
{txt}{ralign 21:Mimicking Var. bins}{col 22} {c |} {col 23}{res}       11{col 37}       46
{txt}{hline 22}{c +}{hline 22}
{lalign 1:Rel. to IMSE-optimal:}{col 22} {c |} 
{ralign 21:Implied scale}{col 22} {c |} {col 23}{res}   11.000{col 37}    6.571
{txt}{ralign 21:WIMSE var. weight}{col 22} {c |} {col 23}{res}    0.001{col 37}    0.004
{txt}{ralign 21:WIMSE bias weight}{col 22} {c |} {col 23}{res}    0.999{col 37}    0.996
{txt}{hline 22}{c BT}{hline 22}

{res}{txt}(file diff_adj_intl_trade_p1.png written in PNG format)
{res}
RD Plot with evenly spaced mimicking variance number of bins using spacings estimators.

{txt}{ralign 21: Cutoff c = 0}{col 22} {c |} {col 23}Left of {res}c{col 36}{txt}Right of {res}c{col 54}{txt}Number of obs  = {res}       231
{txt}{hline 22}{c +}{hline 22}{col 54}Kernel         = {res}{ralign 10:Uniform}
{txt}{ralign 21:Number of obs}{col 22} {c |} {col 23}{res}       91{col 37}      140
{txt}{ralign 21:Eff. Number of obs}{col 22} {c |} {col 23}{res}       91{col 37}      140
{txt}{ralign 21:Order poly. fit (p)}{col 22} {c |} {col 23}{res}        3{col 37}        3
{txt}{ralign 21:BW poly. fit (h)}{col 22} {c |} {col 23}{res}    3.000{col 37}    3.000
{txt}{ralign 21:Number of bins scale}{col 22} {c |} {col 23}{res}    1.000{col 37}    1.000

Outcome: diff_adj_intl_trade. Running variable: distance_from_intv.
{txt}{hline 22}{c TT}{hline 22}
{col 22} {c |} {col 23}Left of {res}c{col 36}{txt}Right of {res}c
{txt}{hline 22}{c +}{hline 22}
{ralign 21:Bins selected}{col 22} {c |} {col 23}{res}       21{col 37}       11
{txt}{ralign 21:Average bin length}{col 22} {c |} {col 23}{res}    0.143{col 37}    0.273
{txt}{ralign 21:Median bin length}{col 22} {c |} {col 23}{res}    0.143{col 37}    0.273
{txt}{hline 22}{c +}{hline 22}
{ralign 21:IMSE-optimal bins}{col 22} {c |} {col 23}{res}        2{col 37}        5
{txt}{ralign 21:Mimicking Var. bins}{col 22} {c |} {col 23}{res}       21{col 37}       11
{txt}{hline 22}{c +}{hline 22}
{lalign 1:Rel. to IMSE-optimal:}{col 22} {c |} 
{ralign 21:Implied scale}{col 22} {c |} {col 23}{res}   10.500{col 37}    2.200
{txt}{ralign 21:WIMSE var. weight}{col 22} {c |} {col 23}{res}    0.001{col 37}    0.086
{txt}{ralign 21:WIMSE bias weight}{col 22} {c |} {col 23}{res}    0.999{col 37}    0.914
{txt}{hline 22}{c BT}{hline 22}

{res}{txt}(file diff_adj_intl_trade_p3.png written in PNG format)
{res}
RD Plot with evenly spaced mimicking variance number of bins using spacings estimators.

{txt}{ralign 21: Cutoff c = 0}{col 22} {c |} {col 23}Left of {res}c{col 36}{txt}Right of {res}c{col 54}{txt}Number of obs  = {res}       233
{txt}{hline 22}{c +}{hline 22}{col 54}Kernel         = {res}{ralign 10:Uniform}
{txt}{ralign 21:Number of obs}{col 22} {c |} {col 23}{res}       91{col 37}      142
{txt}{ralign 21:Eff. Number of obs}{col 22} {c |} {col 23}{res}       91{col 37}      142
{txt}{ralign 21:Order poly. fit (p)}{col 22} {c |} {col 23}{res}        1{col 37}        1
{txt}{ralign 21:BW poly. fit (h)}{col 22} {c |} {col 23}{res}    3.000{col 37}    3.000
{txt}{ralign 21:Number of bins scale}{col 22} {c |} {col 23}{res}    1.000{col 37}    1.000

Outcome: diff_adj_US_trade. Running variable: distance_from_intv.
{txt}{hline 22}{c TT}{hline 22}
{col 22} {c |} {col 23}Left of {res}c{col 36}{txt}Right of {res}c
{txt}{hline 22}{c +}{hline 22}
{ralign 21:Bins selected}{col 22} {c |} {col 23}{res}       19{col 37}        3
{txt}{ralign 21:Average bin length}{col 22} {c |} {col 23}{res}    0.158{col 37}    1.000
{txt}{ralign 21:Median bin length}{col 22} {c |} {col 23}{res}    0.158{col 37}    1.000
{txt}{hline 22}{c +}{hline 22}
{ralign 21:IMSE-optimal bins}{col 22} {c |} {col 23}{res}        3{col 37}        2
{txt}{ralign 21:Mimicking Var. bins}{col 22} {c |} {col 23}{res}       19{col 37}        3
{txt}{hline 22}{c +}{hline 22}
{lalign 1:Rel. to IMSE-optimal:}{col 22} {c |} 
{ralign 21:Implied scale}{col 22} {c |} {col 23}{res}    6.333{col 37}    1.500
{txt}{ralign 21:WIMSE var. weight}{col 22} {c |} {col 23}{res}    0.004{col 37}    0.229
{txt}{ralign 21:WIMSE bias weight}{col 22} {c |} {col 23}{res}    0.996{col 37}    0.771
{txt}{hline 22}{c BT}{hline 22}

{res}{txt}(file diff_adj_US_trade_p1.png written in PNG format)
{res}
RD Plot with evenly spaced mimicking variance number of bins using spacings estimators.

{txt}{ralign 21: Cutoff c = 0}{col 22} {c |} {col 23}Left of {res}c{col 36}{txt}Right of {res}c{col 54}{txt}Number of obs  = {res}       233
{txt}{hline 22}{c +}{hline 22}{col 54}Kernel         = {res}{ralign 10:Uniform}
{txt}{ralign 21:Number of obs}{col 22} {c |} {col 23}{res}       91{col 37}      142
{txt}{ralign 21:Eff. Number of obs}{col 22} {c |} {col 23}{res}       91{col 37}      142
{txt}{ralign 21:Order poly. fit (p)}{col 22} {c |} {col 23}{res}        3{col 37}        3
{txt}{ralign 21:BW poly. fit (h)}{col 22} {c |} {col 23}{res}    3.000{col 37}    3.000
{txt}{ralign 21:Number of bins scale}{col 22} {c |} {col 23}{res}    1.000{col 37}    1.000

Outcome: diff_adj_US_trade. Running variable: distance_from_intv.
{txt}{hline 22}{c TT}{hline 22}
{col 22} {c |} {col 23}Left of {res}c{col 36}{txt}Right of {res}c
{txt}{hline 22}{c +}{hline 22}
{ralign 21:Bins selected}{col 22} {c |} {col 23}{res}        4{col 37}       24
{txt}{ralign 21:Average bin length}{col 22} {c |} {col 23}{res}    0.750{col 37}    0.125
{txt}{ralign 21:Median bin length}{col 22} {c |} {col 23}{res}    0.750{col 37}    0.125
{txt}{hline 22}{c +}{hline 22}
{ralign 21:IMSE-optimal bins}{col 22} {c |} {col 23}{res}        2{col 37}        4
{txt}{ralign 21:Mimicking Var. bins}{col 22} {c |} {col 23}{res}        4{col 37}       24
{txt}{hline 22}{c +}{hline 22}
{lalign 1:Rel. to IMSE-optimal:}{col 22} {c |} 
{ralign 21:Implied scale}{col 22} {c |} {col 23}{res}    2.000{col 37}    6.000
{txt}{ralign 21:WIMSE var. weight}{col 22} {c |} {col 23}{res}    0.111{col 37}    0.005
{txt}{ralign 21:WIMSE bias weight}{col 22} {c |} {col 23}{res}    0.889{col 37}    0.995
{txt}{hline 22}{c BT}{hline 22}

{res}{txt}(file diff_adj_US_trade_p3.png written in PNG format)
{res}
RD Plot with evenly spaced mimicking variance number of bins using spacings estimators.

{txt}{ralign 21: Cutoff c = 0}{col 22} {c |} {col 23}Left of {res}c{col 36}{txt}Right of {res}c{col 54}{txt}Number of obs  = {res}       253
{txt}{hline 22}{c +}{hline 22}{col 54}Kernel         = {res}{ralign 10:Uniform}
{txt}{ralign 21:Number of obs}{col 22} {c |} {col 23}{res}       98{col 37}      155
{txt}{ralign 21:Eff. Number of obs}{col 22} {c |} {col 23}{res}       98{col 37}      155
{txt}{ralign 21:Order poly. fit (p)}{col 22} {c |} {col 23}{res}        1{col 37}        1
{txt}{ralign 21:BW poly. fit (h)}{col 22} {c |} {col 23}{res}    3.000{col 37}    3.000
{txt}{ralign 21:Number of bins scale}{col 22} {c |} {col 23}{res}    1.000{col 37}    1.000

Outcome: diff_intl_trade. Running variable: distance_from_intv.
{txt}{hline 22}{c TT}{hline 22}
{col 22} {c |} {col 23}Left of {res}c{col 36}{txt}Right of {res}c
{txt}{hline 22}{c +}{hline 22}
{ralign 21:Bins selected}{col 22} {c |} {col 23}{res}        9{col 37}        3
{txt}{ralign 21:Average bin length}{col 22} {c |} {col 23}{res}    0.333{col 37}    1.000
{txt}{ralign 21:Median bin length}{col 22} {c |} {col 23}{res}    0.333{col 37}    1.000
{txt}{hline 22}{c +}{hline 22}
{ralign 21:IMSE-optimal bins}{col 22} {c |} {col 23}{res}        3{col 37}        3
{txt}{ralign 21:Mimicking Var. bins}{col 22} {c |} {col 23}{res}        9{col 37}        3
{txt}{hline 22}{c +}{hline 22}
{lalign 1:Rel. to IMSE-optimal:}{col 22} {c |} 
{ralign 21:Implied scale}{col 22} {c |} {col 23}{res}    3.000{col 37}    1.000
{txt}{ralign 21:WIMSE var. weight}{col 22} {c |} {col 23}{res}    0.036{col 37}    0.500
{txt}{ralign 21:WIMSE bias weight}{col 22} {c |} {col 23}{res}    0.964{col 37}    0.500
{txt}{hline 22}{c BT}{hline 22}

{res}{txt}(file diff_intl_trade_p1.png written in PNG format)
{res}
RD Plot with evenly spaced mimicking variance number of bins using spacings estimators.

{txt}{ralign 21: Cutoff c = 0}{col 22} {c |} {col 23}Left of {res}c{col 36}{txt}Right of {res}c{col 54}{txt}Number of obs  = {res}       253
{txt}{hline 22}{c +}{hline 22}{col 54}Kernel         = {res}{ralign 10:Uniform}
{txt}{ralign 21:Number of obs}{col 22} {c |} {col 23}{res}       98{col 37}      155
{txt}{ralign 21:Eff. Number of obs}{col 22} {c |} {col 23}{res}       98{col 37}      155
{txt}{ralign 21:Order poly. fit (p)}{col 22} {c |} {col 23}{res}        3{col 37}        3
{txt}{ralign 21:BW poly. fit (h)}{col 22} {c |} {col 23}{res}    3.000{col 37}    3.000
{txt}{ralign 21:Number of bins scale}{col 22} {c |} {col 23}{res}    1.000{col 37}    1.000

Outcome: diff_intl_trade. Running variable: distance_from_intv.
{txt}{hline 22}{c TT}{hline 22}
{col 22} {c |} {col 23}Left of {res}c{col 36}{txt}Right of {res}c
{txt}{hline 22}{c +}{hline 22}
{ralign 21:Bins selected}{col 22} {c |} {col 23}{res}       10{col 37}       19
{txt}{ralign 21:Average bin length}{col 22} {c |} {col 23}{res}    0.300{col 37}    0.158
{txt}{ralign 21:Median bin length}{col 22} {c |} {col 23}{res}    0.300{col 37}    0.158
{txt}{hline 22}{c +}{hline 22}
{ralign 21:IMSE-optimal bins}{col 22} {c |} {col 23}{res}        3{col 37}        5
{txt}{ralign 21:Mimicking Var. bins}{col 22} {c |} {col 23}{res}       10{col 37}       19
{txt}{hline 22}{c +}{hline 22}
{lalign 1:Rel. to IMSE-optimal:}{col 22} {c |} 
{ralign 21:Implied scale}{col 22} {c |} {col 23}{res}    3.333{col 37}    3.800
{txt}{ralign 21:WIMSE var. weight}{col 22} {c |} {col 23}{res}    0.026{col 37}    0.018
{txt}{ralign 21:WIMSE bias weight}{col 22} {c |} {col 23}{res}    0.974{col 37}    0.982
{txt}{hline 22}{c BT}{hline 22}

{res}{txt}(file diff_intl_trade_p3.png written in PNG format)
{res}
RD Plot with evenly spaced mimicking variance number of bins using spacings estimators.

{txt}{ralign 21: Cutoff c = 0}{col 22} {c |} {col 23}Left of {res}c{col 36}{txt}Right of {res}c{col 54}{txt}Number of obs  = {res}       255
{txt}{hline 22}{c +}{hline 22}{col 54}Kernel         = {res}{ralign 10:Uniform}
{txt}{ralign 21:Number of obs}{col 22} {c |} {col 23}{res}       98{col 37}      157
{txt}{ralign 21:Eff. Number of obs}{col 22} {c |} {col 23}{res}       98{col 37}      157
{txt}{ralign 21:Order poly. fit (p)}{col 22} {c |} {col 23}{res}        1{col 37}        1
{txt}{ralign 21:BW poly. fit (h)}{col 22} {c |} {col 23}{res}    3.000{col 37}    3.000
{txt}{ralign 21:Number of bins scale}{col 22} {c |} {col 23}{res}    1.000{col 37}    1.000

Outcome: diff_US_trade. Running variable: distance_from_intv.
{txt}{hline 22}{c TT}{hline 22}
{col 22} {c |} {col 23}Left of {res}c{col 36}{txt}Right of {res}c
{txt}{hline 22}{c +}{hline 22}
{ralign 21:Bins selected}{col 22} {c |} {col 23}{res}      206{col 37}       35
{txt}{ralign 21:Average bin length}{col 22} {c |} {col 23}{res}    0.015{col 37}    0.086
{txt}{ralign 21:Median bin length}{col 22} {c |} {col 23}{res}    0.015{col 37}    0.086
{txt}{hline 22}{c +}{hline 22}
{ralign 21:IMSE-optimal bins}{col 22} {c |} {col 23}{res}        9{col 37}        4
{txt}{ralign 21:Mimicking Var. bins}{col 22} {c |} {col 23}{res}      206{col 37}       35
{txt}{hline 22}{c +}{hline 22}
{lalign 1:Rel. to IMSE-optimal:}{col 22} {c |} 
{ralign 21:Implied scale}{col 22} {c |} {col 23}{res}   22.889{col 37}    8.750
{txt}{ralign 21:WIMSE var. weight}{col 22} {c |} {col 23}{res}    0.000{col 37}    0.001
{txt}{ralign 21:WIMSE bias weight}{col 22} {c |} {col 23}{res}    1.000{col 37}    0.999
{txt}{hline 22}{c BT}{hline 22}

{res}{txt}(file diff_US_trade_p1.png written in PNG format)
{res}
RD Plot with evenly spaced mimicking variance number of bins using spacings estimators.

{txt}{ralign 21: Cutoff c = 0}{col 22} {c |} {col 23}Left of {res}c{col 36}{txt}Right of {res}c{col 54}{txt}Number of obs  = {res}       255
{txt}{hline 22}{c +}{hline 22}{col 54}Kernel         = {res}{ralign 10:Uniform}
{txt}{ralign 21:Number of obs}{col 22} {c |} {col 23}{res}       98{col 37}      157
{txt}{ralign 21:Eff. Number of obs}{col 22} {c |} {col 23}{res}       98{col 37}      157
{txt}{ralign 21:Order poly. fit (p)}{col 22} {c |} {col 23}{res}        3{col 37}        3
{txt}{ralign 21:BW poly. fit (h)}{col 22} {c |} {col 23}{res}    3.000{col 37}    3.000
{txt}{ralign 21:Number of bins scale}{col 22} {c |} {col 23}{res}    1.000{col 37}    1.000

Outcome: diff_US_trade. Running variable: distance_from_intv.
{txt}{hline 22}{c TT}{hline 22}
{col 22} {c |} {col 23}Left of {res}c{col 36}{txt}Right of {res}c
{txt}{hline 22}{c +}{hline 22}
{ralign 21:Bins selected}{col 22} {c |} {col 23}{res}       11{col 37}       17
{txt}{ralign 21:Average bin length}{col 22} {c |} {col 23}{res}    0.273{col 37}    0.176
{txt}{ralign 21:Median bin length}{col 22} {c |} {col 23}{res}    0.273{col 37}    0.176
{txt}{hline 22}{c +}{hline 22}
{ralign 21:IMSE-optimal bins}{col 22} {c |} {col 23}{res}        4{col 37}        3
{txt}{ralign 21:Mimicking Var. bins}{col 22} {c |} {col 23}{res}       11{col 37}       17
{txt}{hline 22}{c +}{hline 22}
{lalign 1:Rel. to IMSE-optimal:}{col 22} {c |} 
{ralign 21:Implied scale}{col 22} {c |} {col 23}{res}    2.750{col 37}    5.667
{txt}{ralign 21:WIMSE var. weight}{col 22} {c |} {col 23}{res}    0.046{col 37}    0.005
{txt}{ralign 21:WIMSE bias weight}{col 22} {c |} {col 23}{res}    0.954{col 37}    0.995
{txt}{hline 22}{c BT}{hline 22}

{res}{txt}(file diff_US_trade_p3.png written in PNG format)

{com}. 
. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}\\Files\ak29\GitHub\WWS_class\CI_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 8 Nov 2017, 13:50:15
{txt}{.-}
{smcl}
{txt}{sf}{ul off}