
. 
. 
. cd `dataPATH'
C:\Users\fcoca\Downloads

. use `data', clear

. 
. **************************************Q1****************************************
. 
. *standardize control variables and check balance 
. foreach var of local vars {
  2.         egen `var'_std = std(`var')
  3.         tab treat `var'_std if sample == 0, nofreq row
  4.         stddiff `var', by(treat)
  5. }

     =1 if |
 treatment |           Standardized values of (age)     
     group | -1.451613  -1.360958  -1.270304  -1.179649  -1.088995 |     Total
-----------+-------------------------------------------------------+----------
         0 |      8.08      10.00       8.08       5.77       3.85 |    100.00 
         1 |      7.03       7.03       6.49       4.86       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      7.64       8.76       7.42       5.39       4.27 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group | -.9983405  -.9076861  -.8170317  -.7263772  -.6357228 |     Total
-----------+-------------------------------------------------------+----------
         0 |      6.15       5.77       5.77       8.46       4.62 |    100.00 
         1 |      5.95       6.49       4.86       9.73       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      6.07       6.07       5.39       8.99       4.72 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group | -.5450683  -.4544139  -.3637594   -.273105  -.1824505 |     Total
-----------+-------------------------------------------------------+----------
         0 |      4.23       5.77       3.85       1.54       3.08 |    100.00 
         1 |      8.65       3.24       4.86       1.62       3.78 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      6.07       4.72       4.27       1.57       3.37 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group | -.0917961  -.0011417   .0895128   .1801672   .2708217 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.54       1.92       2.31       0.77       1.54 |    100.00 
         1 |      0.54       2.70       0.00       1.62       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.12       2.25       1.35       1.12       0.90 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group |  .3614761   .4521306    .542785   .6334395   .7240939 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.00       1.15       1.92       0.00       0.00 |    100.00 
         1 |      1.08       1.62       0.00       1.08       1.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.45       1.35       1.12       0.45       0.45 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group |  .8147483   .9054028   .9960572   1.086712   1.177366 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.38       0.38       1.15       0.77       0.00 |    100.00 
         1 |      2.16       0.54       0.54       0.54       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.12       0.45       0.90       0.67       0.67 |    100.00 


     =1 if |
 treatment |      Standardized values of (age)     
     group |  1.358675   1.539984   1.902602   1.993256 |     Total
-----------+--------------------------------------------+----------
         0 |      0.00       0.38       0.38       0.38 |    100.00 
         1 |      0.54       0.00       0.00       0.00 |    100.00 
-----------+--------------------------------------------+----------
     Total |      0.22       0.22       0.22       0.22 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         age |     33.09         11.04 |     25.82         7.155 |    0.78238
------------------------------------------------------------------------------

     =1 if |
 treatment |           Standardized values of (age2)     
     group | -1.179615  -1.134861  -1.087548  -1.037679  -.9852515 |     Total
-----------+-------------------------------------------------------+----------
         0 |      8.08      10.00       8.08       5.77       3.85 |    100.00 
         1 |      7.03       7.03       6.49       4.86       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      7.64       8.76       7.42       5.39       4.27 |    100.00 


     =1 if |
 treatment |           Standardized values of (age2)     
     group |  -.930267  -.8727251  -.8126258   -.749969  -.6847548 |     Total
-----------+-------------------------------------------------------+----------
         0 |      6.15       5.77       5.77       8.46       4.62 |    100.00 
         1 |      5.95       6.49       4.86       9.73       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      6.07       6.07       5.39       8.99       4.72 |    100.00 


     =1 if |
 treatment |           Standardized values of (age2)     
     group | -.6169832  -.5466542  -.4737678  -.3983239  -.3203227 |     Total
-----------+-------------------------------------------------------+----------
         0 |      4.23       5.77       3.85       1.54       3.08 |    100.00 
         1 |      8.65       3.24       4.86       1.62       3.78 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      6.07       4.72       4.27       1.57       3.37 |    100.00 


     =1 if |
 treatment |           Standardized values of (age2)     
     group |  -.239764  -.1566479  -.0709743   .0172566    .108045 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.54       1.92       2.31       0.77       1.54 |    100.00 
         1 |      0.54       2.70       0.00       1.62       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.12       2.25       1.35       1.12       0.90 |    100.00 


     =1 if |
 treatment |           Standardized values of (age2)     
     group |  .2013908    .297294   .3957546   .4967726   .6003481 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.00       1.15       1.92       0.00       0.00 |    100.00 
         1 |      1.08       1.62       0.00       1.08       1.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.45       1.35       1.12       0.45       0.45 |    100.00 


     =1 if |
 treatment |           Standardized values of (age2)     
     group |   .706481   .8151713    .926419   1.040224   1.156587 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.38       0.38       1.15       0.77       0.00 |    100.00 
         1 |      2.16       0.54       0.54       0.54       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.12       0.45       0.90       0.67       0.67 |    100.00 


     =1 if |
 treatment |     Standardized values of (age2)     
     group |  1.396984   1.647611   2.179554   2.318933 |     Total
-----------+--------------------------------------------+----------
         0 |      0.00       0.38       0.38       0.38 |    100.00 
         1 |      0.54       0.00       0.00       0.00 |    100.00 
-----------+--------------------------------------------+----------
     Total |      0.22       0.22       0.22       0.22 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        age2 |      1217        783.35 |     717.4        431.25 |    0.79034
------------------------------------------------------------------------------

     =1 if |
 treatment |            Standardized values of (ed)     
     group | -3.136414  -2.787066  -2.437718  -2.088371  -1.739023 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.38       0.38       0.77       1.54       2.69 |    100.00 
         1 |      0.00       2.16       1.62       0.54       1.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.22       1.12       1.12       1.12       2.02 |    100.00 


     =1 if |
 treatment |            Standardized values of (ed)     
     group | -1.389675  -1.040328  -.6909802  -.3416325   .0077151 |     Total
-----------+-------------------------------------------------------+----------
         0 |      8.08      15.38      27.31      26.92      13.85 |    100.00 
         1 |      9.73      15.14      16.76      23.78      21.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      8.76      15.28      22.92      25.62      16.85 |    100.00 


     =1 if |
 treatment |      Standardized values of (ed)     
     group |  .3570628   .7064104   1.055758   1.405106 |     Total
-----------+--------------------------------------------+----------
         0 |      1.92       0.77       0.00       0.00 |    100.00 
         1 |      4.32       2.70       0.54       0.54 |    100.00 
-----------+--------------------------------------------+----------
     Total |      2.92       1.57       0.22       0.22 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
          ed |        12        2.8654 |     10.35        2.0107 |    0.66683
------------------------------------------------------------------------------

     =1 if |  Standardized values
 treatment |    of (black)     
     group |  -.322318   3.102337 |     Total
-----------+----------------------+----------
         0 |     17.31      82.69 |    100.00 
         1 |     15.68      84.32 |    100.00 
-----------+----------------------+----------
     Total |     16.63      83.37 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
       black |    .08559        .27977 |     .8432        .36456 |   -2.33168
------------------------------------------------------------------------------

     =1 if |  Standardized values
 treatment |    of (hisp)     
     group |  -.279489   3.577741 |     Total
-----------+----------------------+----------
         0 |     89.23      10.77 |    100.00 
         1 |     94.05       5.95 |    100.00 
-----------+----------------------+----------
     Total |     91.24       8.76 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        hisp |    .07261         .2595 |    .05946        .23712 |    0.05289
------------------------------------------------------------------------------

     =1 if |  Standardized values
 treatment |   of (married)     
     group | -1.516728   .6592741 |     Total
-----------+----------------------+----------
         0 |     84.62      15.38 |    100.00 
         1 |     81.08      18.92 |    100.00 
-----------+----------------------+----------
     Total |     83.15      16.85 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
     married |     .7028        .45704 |     .1892        .39272 |    1.20541
------------------------------------------------------------------------------

     =1 if |  Standardized values
 treatment |    of (nodeg)     
     group | -.6686902    1.49537 |     Total
-----------+----------------------+----------
         0 |     16.54      83.46 |    100.00 
         1 |     29.19      70.81 |    100.00 
-----------+----------------------+----------
     Total |     21.80      78.20 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
       nodeg |     .3045        .46019 |     .7081        .45587 |   -0.88127
------------------------------------------------------------------------------

. 
. *check balance of lagged dep var
. foreach var of varlist re74 re75 {
  2.         stddiff `var', by(treat)
  3. }

------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        re74 |     13826        9636.6 |      2096        4886.6 |    1.53540
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        re75 |     13453        9334.5 |      1532        3219.3 |    1.70734
------------------------------------------------------------------------------

. 
. *examine effect of treatment variable in sample
. reg re78 treat

      Source |       SS           df       MS      Number of obs   =    16,437
-------------+----------------------------------   F(1, 16435)     =    136.03
       Model |  1.2701e+10         1  1.2701e+10   Prob > F        =    0.0000
    Residual |  1.5346e+12    16,435    93373521   R-squared       =    0.0082
-------------+----------------------------------   Adj R-squared   =    0.0081
       Total |  1.5473e+12    16,436  94140607.2   Root MSE        =      9663

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |  -8332.867   714.4698   -11.66   0.000    -9733.305   -6932.428
       _cons |   14682.01   75.79812   193.70   0.000     14533.44    14830.58
------------------------------------------------------------------------------

. *************************************Q2*****************************************
. 
. *create a flag for CPS only treatment control
. gen treat2 = .
(16,437 missing values generated)

. replace treat2 = 1 if sample == 0 & treat == 1
(185 real changes made)

. replace treat2 = 0 if sample == 1 & treat == 0
(15,992 real changes made)

. 
. *check
. *tab treat2 sample
. 
. *check balance in control variables 
. foreach var of local vars {
  2.         tab treat2 `var'_std, nofreq row
  3.         stddiff `var', by(treat2)
  4.         }

           |           Standardized values of (age)     
    treat2 | -1.542267  -1.451613  -1.360958  -1.270304  -1.179649 |     Total
-----------+-------------------------------------------------------+----------
         0 |      2.11       2.47       2.98       2.91       2.84 |    100.00 
         1 |      0.00       7.03       7.03       6.49       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      2.09       2.52       3.02       2.95       2.86 |    100.00 


           |           Standardized values of (age)     
    treat2 | -1.088995  -.9983405  -.9076861  -.8170317  -.7263772 |     Total
-----------+-------------------------------------------------------+----------
         0 |      3.16       2.94       3.15       3.27       3.42 |    100.00 
         1 |      4.86       5.95       6.49       4.86       9.73 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      3.18       2.97       3.18       3.29       3.49 |    100.00 


           |           Standardized values of (age)     
    treat2 | -.6357228  -.5450683  -.4544139  -.3637594   -.273105 |     Total
-----------+-------------------------------------------------------+----------
         0 |      3.65       3.65       4.06       4.13       2.92 |    100.00 
         1 |      4.86       8.65       3.24       4.86       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      3.66       3.71       4.05       4.14       2.91 |    100.00 


           |           Standardized values of (age)     
    treat2 | -.1824505  -.0917961  -.0011417   .0895128   .1801672 |     Total
-----------+-------------------------------------------------------+----------
         0 |      2.86       2.94       2.84       2.66       2.41 |    100.00 
         1 |      3.78       0.54       2.70       0.00       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      2.87       2.91       2.84       2.63       2.40 |    100.00 


           |           Standardized values of (age)     
    treat2 |  .2708217   .3614761   .4521306    .542785   .6334395 |     Total
-----------+-------------------------------------------------------+----------
         0 |      2.27       2.10       2.16       2.02       1.95 |    100.00 
         1 |      0.00       1.08       1.62       0.00       1.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      2.24       2.09       2.16       2.00       1.94 |    100.00 


           |           Standardized values of (age)     
    treat2 |  .7240939   .8147483   .9054028   .9960572   1.086712 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.95       1.93       1.78       1.81       1.94 |    100.00 
         1 |      1.08       2.16       0.54       0.54       0.54 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.94       1.93       1.76       1.80       1.92 |    100.00 


           |           Standardized values of (age)     
    treat2 |  1.177366   1.268021   1.358675   1.449329   1.539984 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.83       1.94       1.89       1.86       1.91 |    100.00 
         1 |      1.62       0.00       0.54       0.00       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.83       1.92       1.88       1.84       1.89 |    100.00 


           |           Standardized values of (age)     
    treat2 |  1.630638   1.721293   1.811947   1.902602   1.993256 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.96       1.84       1.88       1.69       1.92 |    100.00 
         1 |      0.00       0.00       0.00       0.00       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.94       1.82       1.85       1.67       1.90 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         age |     33.23        11.045 |     25.82         7.155 |    0.79618
------------------------------------------------------------------------------

           |           Standardized values of (age2)     
    treat2 | -1.221813  -1.179615  -1.134861  -1.087548  -1.037679 |     Total
-----------+-------------------------------------------------------+----------
         0 |      2.11       2.47       2.98       2.91       2.84 |    100.00 
         1 |      0.00       7.03       7.03       6.49       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      2.09       2.52       3.02       2.95       2.86 |    100.00 


           |           Standardized values of (age2)     
    treat2 | -.9852515   -.930267  -.8727251  -.8126258   -.749969 |     Total
-----------+-------------------------------------------------------+----------
         0 |      3.16       2.94       3.15       3.27       3.42 |    100.00 
         1 |      4.86       5.95       6.49       4.86       9.73 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      3.18       2.97       3.18       3.29       3.49 |    100.00 


           |           Standardized values of (age2)     
    treat2 | -.6847548  -.6169832  -.5466542  -.4737678  -.3983239 |     Total
-----------+-------------------------------------------------------+----------
         0 |      3.65       3.65       4.06       4.13       2.92 |    100.00 
         1 |      4.86       8.65       3.24       4.86       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      3.66       3.71       4.05       4.14       2.91 |    100.00 


           |           Standardized values of (age2)     
    treat2 | -.3203227   -.239764  -.1566479  -.0709743   .0172566 |     Total
-----------+-------------------------------------------------------+----------
         0 |      2.86       2.94       2.84       2.66       2.41 |    100.00 
         1 |      3.78       0.54       2.70       0.00       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      2.87       2.91       2.84       2.63       2.40 |    100.00 


           |           Standardized values of (age2)     
    treat2 |   .108045   .2013908    .297294   .3957546   .4967726 |     Total
-----------+-------------------------------------------------------+----------
         0 |      2.27       2.10       2.16       2.02       1.95 |    100.00 
         1 |      0.00       1.08       1.62       0.00       1.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      2.24       2.09       2.16       2.00       1.94 |    100.00 


           |           Standardized values of (age2)     
    treat2 |  .6003481    .706481   .8151713    .926419   1.040224 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.95       1.93       1.78       1.81       1.94 |    100.00 
         1 |      1.08       2.16       0.54       0.54       0.54 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.94       1.93       1.76       1.80       1.92 |    100.00 


           |           Standardized values of (age2)     
    treat2 |  1.156587   1.275507   1.396984   1.521019   1.647611 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.83       1.94       1.89       1.86       1.91 |    100.00 
         1 |      1.62       0.00       0.54       0.00       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.83       1.92       1.88       1.84       1.89 |    100.00 


           |           Standardized values of (age2)     
    treat2 |  1.776761   1.908468   2.042732   2.179554   2.318933 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.96       1.84       1.88       1.69       1.92 |    100.00 
         1 |      0.00       0.00       0.00       0.00       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.94       1.82       1.85       1.67       1.90 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        age2 |      1226        784.74 |     717.4        431.25 |    0.80313
------------------------------------------------------------------------------

           |            Standardized values of (ed)     
    treat2 | -4.184457  -3.835109  -3.485761  -3.136414  -2.787066 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.23       0.09       0.25       0.46       0.60 |    100.00 
         1 |      0.00       0.00       0.00       0.00       2.16 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.22       0.09       0.25       0.45       0.62 |    100.00 


           |            Standardized values of (ed)     
    treat2 | -2.437718  -2.088371  -1.739023  -1.389675  -1.040328 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.69       1.41       1.74       5.33       5.13 |    100.00 
         1 |      1.62       0.54       1.08       9.73      15.14 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.70       1.40       1.73       5.38       5.25 |    100.00 


           |            Standardized values of (ed)     
    treat2 | -.6909802  -.3416325   .0077151   .3570628   .7064104 |     Total
-----------+-------------------------------------------------------+----------
         0 |      7.03       6.62      39.09       6.73       7.24 |    100.00 
         1 |     16.76      23.78      21.08       4.32       2.70 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      7.15       6.82      38.89       6.71       7.19 |    100.00 


           |      Standardized values of (ed)     
    treat2 |  1.055758   1.405106   1.754453   2.103801 |     Total
-----------+--------------------------------------------+----------
         0 |      2.96       8.55       2.08       3.76 |    100.00 
         1 |      0.54       0.54       0.00       0.00 |    100.00 
-----------+--------------------------------------------+----------
     Total |      2.93       8.46       2.06       3.72 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
          ed |     12.03        2.8708 |     10.35        2.0107 |    0.67850
------------------------------------------------------------------------------

           |  Standardized values
           |    of (black)     
    treat2 |  -.322318   3.102337 |     Total
-----------+----------------------+----------
         0 |     92.65       7.35 |    100.00 
         1 |     15.68      84.32 |    100.00 
-----------+----------------------+----------
     Total |     91.77       8.23 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
       black |    .07354        .26102 |     .8432        .36456 |   -2.42775
------------------------------------------------------------------------------

           |  Standardized values
           |    of (hisp)     
    treat2 |  -.279489   3.577741 |     Total
-----------+----------------------+----------
         0 |     92.80       7.20 |    100.00 
         1 |     94.05       5.95 |    100.00 
-----------+----------------------+----------
     Total |     92.81       7.19 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        hisp |    .07204        .25856 |    .05946        .23712 |    0.05070
------------------------------------------------------------------------------

           |  Standardized values
           |   of (married)     
    treat2 | -1.516728   .6592741 |     Total
-----------+----------------------+----------
         0 |     28.83      71.17 |    100.00 
         1 |     81.08      18.92 |    100.00 
-----------+----------------------+----------
     Total |     29.42      70.58 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
     married |     .7117        .45297 |     .1892        .39272 |    1.23265
------------------------------------------------------------------------------

           |  Standardized values
           |    of (nodeg)     
    treat2 | -.6686902    1.49537 |     Total
-----------+----------------------+----------
         0 |     70.42      29.58 |    100.00 
         1 |     29.19      70.81 |    100.00 
-----------+----------------------+----------
     Total |     69.94      30.06 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
       nodeg |     .2958        .45643 |     .7081        .45587 |   -0.90381
------------------------------------------------------------------------------

. 
. *check balance of lagged dep var
. foreach var of varlist re74 re75 {
  2.         stddiff `var', by(treat)
  3. }

------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        re74 |     13826        9636.6 |      2096        4886.6 |    1.53540
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        re75 |     13453        9334.5 |      1532        3219.3 |    1.70734
------------------------------------------------------------------------------

. 
.         
. *examine effect of treatment variable in sample
. reg re78 treat2 

      Source |       SS           df       MS      Number of obs   =    16,177
-------------+----------------------------------   F(1, 16175)     =    142.43
       Model |  1.3206e+10         1  1.3206e+10   Prob > F        =    0.0000
    Residual |  1.4997e+12    16,175    92717516   R-squared       =    0.0087
-------------+----------------------------------   Adj R-squared   =    0.0087
       Total |  1.5129e+12    16,176  93528158.7   Root MSE        =      9629

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      treat2 |  -8497.516   712.0207   -11.93   0.000    -9893.156   -7101.877
       _cons |   14846.66   76.14292   194.98   0.000     14697.41    14995.91
------------------------------------------------------------------------------

. 
. *************************************Q3*****************************************
. 
. *control for observables using CPS control group
. reg re78 `vars' re74 re75

      Source |       SS           df       MS      Number of obs   =    16,437
-------------+----------------------------------   F(9, 16427)     =   1695.83
       Model |  7.4522e+11         9  8.2802e+10   Prob > F        =    0.0000
    Residual |  8.0208e+11    16,427  48826745.8   R-squared       =    0.4816
-------------+----------------------------------   Adj R-squared   =    0.4813
       Total |  1.5473e+12    16,436  94140607.2   Root MSE        =    6987.6

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -218.9259   40.52588    -5.40   0.000     -298.361   -139.4908
        age2 |   1.644783   .5527222     2.98   0.003     .5613875    2.728179
          ed |   163.2255   28.44557     5.74   0.000     107.4691    218.9819
       black |  -888.2026   193.5636    -4.59   0.000    -1267.608    -508.797
        hisp |  -164.1817   216.3385    -0.76   0.448    -588.2285    259.8652
     married |   196.7057   147.6673     1.33   0.183    -92.73828    486.1497
       nodeg |   270.7183   175.8794     1.54   0.124    -74.02432    615.4609
        re74 |   .2893145   .0120907    23.93   0.000     .2656155    .3130135
        re75 |   .4738033   .0120667    39.27   0.000     .4501514    .4974553
       _cons |   7470.201   726.8671    10.28   0.000     6045.463     8894.94
------------------------------------------------------------------------------

. 
. 
. ************************************Q4******************************************
. 
. qui psmatch2 treat2 `vars' re74 re75

. ren _pscore pscore

. ren _support csupport

. 
. *check common support
. tab treat2 csupport

           | psmatch2:
           |   Common
           |  support
    treat2 | On suppor |     Total
-----------+-----------+----------
         0 |    15,992 |    15,992 
         1 |       185 |       185 
-----------+-----------+----------
     Total |    16,177 |    16,177 


. 
. *check common support
. bysort treat2: sum pscore, det

--------------------------------------------------------------------------------------
-> treat2 = 0

                 psmatch2: Propensity Score
-------------------------------------------------------------
      Percentiles      Smallest
 1%     9.47e-19       2.08e-21
 5%     1.26e-14       2.08e-21
10%     5.65e-12       2.08e-21       Obs              15,992
25%     2.42e-09       2.08e-21       Sum of Wgt.      15,992

50%     2.38e-06                      Mean           .0078785
                        Largest       Std. Dev.      .0415291
75%     .0008381       .6785443
90%     .0069475       .6893522       Variance       .0017247
95%     .0217886       .6985255       Skewness       8.519186
99%     .2359516       .7096074       Kurtosis       90.90878

--------------------------------------------------------------------------------------
-> treat2 = 1

                 psmatch2: Propensity Score
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0008007       .0002929
 5%     .0047228       .0008007
10%     .0141319       .0008178       Obs                 185
25%     .1508836       .0010259       Sum of Wgt.         185

50%     .3113973                      Mean           .3230468
                        Largest       Std. Dev.      .2139958
75%     .4479449         .71388
90%     .6566437       .7179367       Variance       .0457942
95%     .6850162       .7209927       Skewness       .2173457
99%     .7209927       .7372084       Kurtosis       2.091492

--------------------------------------------------------------------------------------
-> treat2 = .

                 psmatch2: Propensity Score
-------------------------------------------------------------
no observations


. 
. 
. *manually calculate pscore and check common support
. logit treat2 `var' re74 re75

Iteration 0:   log likelihood = -1011.0713  
Iteration 1:   log likelihood = -900.51926  
Iteration 2:   log likelihood = -816.77858  
Iteration 3:   log likelihood = -807.51065  
Iteration 4:   log likelihood = -807.12507  
Iteration 5:   log likelihood = -807.12363  
Iteration 6:   log likelihood = -807.12363  

Logistic regression                             Number of obs     =     16,177
                                                LR chi2(2)        =     407.90
                                                Prob > chi2       =     0.0000
Log likelihood = -807.12363                     Pseudo R2         =     0.2017

------------------------------------------------------------------------------
      treat2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        re74 |  -.0000694   .0000224    -3.10   0.002    -.0001133   -.0000255
        re75 |  -.0002215   .0000309    -7.16   0.000    -.0002821   -.0001609
       _cons |  -2.857019   .0875781   -32.62   0.000    -3.028669   -2.685369
------------------------------------------------------------------------------

. predict pscore_m
(option pr assumed; Pr(treat2))

. 
. *check common support
. bysort treat2: sum pscore_m, det

--------------------------------------------------------------------------------------
-> treat2 = 0

                         Pr(treat2)
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0000356       .0000356
 5%     .0000356       .0000356
10%     .0000356       .0000356       Obs              15,992
25%     .0000773       .0000356       Sum of Wgt.      15,992

50%     .0008319                      Mean           .0110802
                        Largest       Std. Dev.      .0180252
75%     .0140764       .0543196
90%     .0485223       .0543196       Variance       .0003249
95%     .0543196       .0543196       Skewness       1.520561
99%     .0543196       .0543196       Kurtosis       3.756321

--------------------------------------------------------------------------------------
-> treat2 = 1

                         Pr(treat2)
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .000392       .0000792
 5%     .0080184        .000392
10%     .0116168       .0004131       Obs                 185
25%     .0302621       .0010434       Sum of Wgt.         185

50%     .0543196                      Mean           .0421933
                        Largest       Std. Dev.      .0173535
75%     .0543196       .0543196
90%     .0543196       .0543196       Variance       .0003011
95%     .0543196       .0543196       Skewness      -1.076277
99%     .0543196       .0543196       Kurtosis       2.638778

--------------------------------------------------------------------------------------
-> treat2 = .

                         Pr(treat2)
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0004068       .0000587
 5%     .0053753       .0002419
10%     .0106767       .0004068       Obs                 260
25%     .0407108       .0007904       Sum of Wgt.         260

50%     .0543196                      Mean           .0447184
                        Largest       Std. Dev.      .0167528
75%     .0543196       .0543196
90%     .0543196       .0543196       Variance       .0002807
95%     .0543196       .0543196       Skewness       -1.55949
99%     .0543196       .0543196       Kurtosis       3.924221


. 
. *graphical check
. /*
> graph twoway \\\
>         (kdensity pscore if treat2 == 1) \\\
>         (kdensity pscore if treat2 == 0 & pscore > .003)
> */
. 
. *manual common support
. egen min_pscm_t = min(pscore_m) if treat == 1
(16252 missing values generated)

. egen min_pscm = min(min_pscm_t)

. gen csupport_m = 1

. replace csupport_m = 0 if pscore_m < min_pscm
(4,045 real changes made)

. tab csupport_m

 csupport_m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,045       24.61       24.61
          1 |     12,392       75.39      100.00
------------+-----------------------------------
      Total |     16,437      100.00

. 
. drop _*

. 
. ************************************Q6******************************************
. 
. *propensity score matching estimation
. psmatch2 treat2 `vars' re74 re75, out(re78) ate common

Probit regression                               Number of obs     =     16,177
                                                LR chi2(9)        =    1105.79
                                                Prob > chi2       =     0.0000
Log likelihood = -458.17408                     Pseudo R2         =     0.5468

------------------------------------------------------------------------------
      treat2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .3688472   .0437743     8.43   0.000     .2830511    .4546433
        age2 |  -.0059857   .0007341    -8.15   0.000    -.0074245   -.0045469
          ed |  -.0122424   .0229324    -0.53   0.593     -.057189    .0327043
       black |   1.826743   .1063787    17.17   0.000     1.618245    2.035242
        hisp |   .6624671   .1659565     3.99   0.000     .3371983    .9877359
     married |  -.6873024    .113316    -6.07   0.000    -.9093977   -.4652071
       nodeg |   .6792456   .1364881     4.98   0.000     .4117339    .9467574
        re74 |   -.000028   .0000123    -2.27   0.023    -.0000521   -3.81e-06
        re75 |  -.0000987   .0000157    -6.30   0.000    -.0001295    -.000068
       _cons |  -7.484834   .6895371   -10.85   0.000    -8.836302   -6.133366
------------------------------------------------------------------------------
Note: 3032 failures and 0 successes completely determined.
--------------------------------------------------------------------------------------
> --
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-st
> at
----------------------------+---------------------------------------------------------
> --
            re78  Unmatched |  6349.1435   14846.6597  -8497.51615    712.02072   -11.
> 93
                        ATT | 6498.00417   4840.04982   1657.95436   974.193868     1.
> 70
                        ATU | 7998.14082   9748.50399   1750.36317            .       
>  .
                        ATE |                           1747.10767            .       
>  .
----------------------------+---------------------------------------------------------
> --
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |    11,090      4,902 |    15,992 
   Treated |         6        179 |       185 
-----------+----------------------+----------
     Total |    11,096      5,081 |    16,177 


. 
. *examine ATE, ATT, ATU
. 
. di "------------Average Treatment Effects------------------"
------------Average Treatment Effects------------------

. di `r(ate)'
1747.1077

. 
. di "------------Average Treatment On Treat-----------------"
------------Average Treatment On Treat-----------------

. di `r(att)'
1657.9544

. 
. di "------------Average Treatment On Untreated-------------"
------------Average Treatment On Untreated-------------

. di `r(atu)'
1750.3632

. 
. 
. 
. 
. *repeat using teffects pscore matching 
. teffects psmatch (re78) (treat2 `vars'), ate  pstolerance(1e-9)

Treatment-effects estimation                   Number of obs      =     16,177
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =        138
------------------------------------------------------------------------------
             |              AI Robust
        re78 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATE          |
      treat2 |
   (1 vs 0)  |  -6681.563    3870.27    -1.73   0.084    -14267.15    904.0278
------------------------------------------------------------------------------

. teffects psmatch (re78) (treat2 `vars'), atet pstolerance(1e-9)

Treatment-effects estimation                   Number of obs      =     16,177
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =        138
------------------------------------------------------------------------------
             |              AI Robust
        re78 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
      treat2 |
   (1 vs 0)  |  -3844.111   880.1469    -4.37   0.000    -5569.167   -2119.054
------------------------------------------------------------------------------

. 
. *repeat excercise using Angrist (2009) restriction
. keep if _pscore > .1
(15,674 observations deleted)

. keep if _pscore < .9
(260 observations deleted)

. 
. 
. psmatch2 treat2 `vars' re74 re75, out(re78) ate common

Probit regression                               Number of obs     =        503
                                                LR chi2(9)        =      89.83
                                                Prob > chi2       =     0.0000
Log likelihood = -262.43432                     Pseudo R2         =     0.1461

------------------------------------------------------------------------------
      treat2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |    .397204   .0678414     5.85   0.000     .2642374    .5301706
        age2 |  -.0064584   .0011542    -5.60   0.000    -.0087206   -.0041962
          ed |   .0026808   .0343602     0.08   0.938     -.064664    .0700256
       black |   5.646614   125.4857     0.04   0.964    -240.3008     251.594
        hisp |   4.562587    125.486     0.04   0.971    -241.3855    250.5106
     married |  -.8877276   .1794089    -4.95   0.000    -1.239363   -.5360926
       nodeg |   .9360543   .1952209     4.79   0.000     .5534283     1.31868
        re74 |  -.0000306   .0000202    -1.52   0.130    -.0000701    8.96e-06
        re75 |  -.0001516    .000035    -4.33   0.000    -.0002202   -.0000831
       _cons |   -11.8765   125.4902    -0.09   0.925    -257.8328    234.0798
------------------------------------------------------------------------------
--------------------------------------------------------------------------------------
> --
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-st
> at
----------------------------+---------------------------------------------------------
> --
            re78  Unmatched | 6033.09769   5302.77557   730.322119   665.751529     1.
> 10
                        ATT | 6085.14632     3668.616   2416.53031   982.296262     2.
> 46
                        ATU | 5044.17366   5462.65449   418.480832            .       
>  .
                        ATE |                           1047.65386            .       
>  .
----------------------------+---------------------------------------------------------
> --
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |        30        322 |       352 
   Treated |         3        148 |       151 
-----------+----------------------+----------
     Total |        33        470 |       503 


. 
. teffects psmatch (re78) (treat2 `vars'), ate  pstolerance(1e-9)

Treatment-effects estimation                   Number of obs      =        503
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =         11
------------------------------------------------------------------------------
             |              AI Robust
        re78 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATE          |
      treat2 |
   (1 vs 0)  |    1527.85   905.9852     1.69   0.092    -247.8487    3303.548
------------------------------------------------------------------------------

. teffects psmatch (re78) (treat2 `vars'), atet pstolerance(1e-9)

Treatment-effects estimation                   Number of obs      =        503
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =         11
------------------------------------------------------------------------------
             |              AI Robust
        re78 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
      treat2 |
   (1 vs 0)  |   1073.967   872.6067     1.23   0.218    -636.3104    2784.245
------------------------------------------------------------------------------

. 
. 
. ********************************************************************************
. 
. 
. 
. 
. 
. cap restore not

. cap log close
