
. 
. 
. cd `dataPATH'
C:\Users\fcoca\Downloads

. use `data', clear

. 
. **************************************Q1****************************************
. 
. *standardize control variables and check balance 
. foreach var of local vars {
  2.         egen `var'_std = std(`var')
  3.         tab treat `var'_std if sample == 0, nofreq row
  4.         stddiff `var', by(treat)
  5. }

     =1 if |
 treatment |           Standardized values of (age)     
     group | -1.451613  -1.360958  -1.270304  -1.179649  -1.088995 |     Total
-----------+-------------------------------------------------------+----------
         0 |      8.08      10.00       8.08       5.77       3.85 |    100.00 
         1 |      7.03       7.03       6.49       4.86       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      7.64       8.76       7.42       5.39       4.27 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group | -.9983405  -.9076861  -.8170317  -.7263772  -.6357228 |     Total
-----------+-------------------------------------------------------+----------
         0 |      6.15       5.77       5.77       8.46       4.62 |    100.00 
         1 |      5.95       6.49       4.86       9.73       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      6.07       6.07       5.39       8.99       4.72 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group | -.5450683  -.4544139  -.3637594   -.273105  -.1824505 |     Total
-----------+-------------------------------------------------------+----------
         0 |      4.23       5.77       3.85       1.54       3.08 |    100.00 
         1 |      8.65       3.24       4.86       1.62       3.78 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      6.07       4.72       4.27       1.57       3.37 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group | -.0917961  -.0011417   .0895128   .1801672   .2708217 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.54       1.92       2.31       0.77       1.54 |    100.00 
         1 |      0.54       2.70       0.00       1.62       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.12       2.25       1.35       1.12       0.90 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group |  .3614761   .4521306    .542785   .6334395   .7240939 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.00       1.15       1.92       0.00       0.00 |    100.00 
         1 |      1.08       1.62       0.00       1.08       1.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.45       1.35       1.12       0.45       0.45 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group |  .8147483   .9054028   .9960572   1.086712   1.177366 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.38       0.38       1.15       0.77       0.00 |    100.00 
         1 |      2.16       0.54       0.54       0.54       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.12       0.45       0.90       0.67       0.67 |    100.00 


     =1 if |
 treatment |      Standardized values of (age)     
     group |  1.358675   1.539984   1.902602   1.993256 |     Total
-----------+--------------------------------------------+----------
         0 |      0.00       0.38       0.38       0.38 |    100.00 
         1 |      0.54       0.00       0.00       0.00 |    100.00 
-----------+--------------------------------------------+----------
     Total |      0.22       0.22       0.22       0.22 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         age |     33.09         11.04 |     25.82         7.155 |    0.78238
------------------------------------------------------------------------------

     =1 if |
 treatment |            Standardized values of (ed)     
     group | -3.136414  -2.787066  -2.437718  -2.088371  -1.739023 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.38       0.38       0.77       1.54       2.69 |    100.00 
         1 |      0.00       2.16       1.62       0.54       1.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.22       1.12       1.12       1.12       2.02 |    100.00 


     =1 if |
 treatment |            Standardized values of (ed)     
     group | -1.389675  -1.040328  -.6909802  -.3416325   .0077151 |     Total
-----------+-------------------------------------------------------+----------
         0 |      8.08      15.38      27.31      26.92      13.85 |    100.00 
         1 |      9.73      15.14      16.76      23.78      21.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      8.76      15.28      22.92      25.62      16.85 |    100.00 


     =1 if |
 treatment |      Standardized values of (ed)     
     group |  .3570628   .7064104   1.055758   1.405106 |     Total
-----------+--------------------------------------------+----------
         0 |      1.92       0.77       0.00       0.00 |    100.00 
         1 |      4.32       2.70       0.54       0.54 |    100.00 
-----------+--------------------------------------------+----------
     Total |      2.92       1.57       0.22       0.22 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
          ed |        12        2.8654 |     10.35        2.0107 |    0.66683
------------------------------------------------------------------------------

     =1 if |  Standardized values
 treatment |    of (black)     
     group |  -.322318   3.102337 |     Total
-----------+----------------------+----------
         0 |     17.31      82.69 |    100.00 
         1 |     15.68      84.32 |    100.00 
-----------+----------------------+----------
     Total |     16.63      83.37 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
       black |    .08559        .27977 |     .8432        .36456 |   -2.33168
------------------------------------------------------------------------------

     =1 if |  Standardized values
 treatment |    of (hisp)     
     group |  -.279489   3.577741 |     Total
-----------+----------------------+----------
         0 |     89.23      10.77 |    100.00 
         1 |     94.05       5.95 |    100.00 
-----------+----------------------+----------
     Total |     91.24       8.76 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        hisp |    .07261         .2595 |    .05946        .23712 |    0.05289
------------------------------------------------------------------------------

     =1 if |  Standardized values
 treatment |   of (married)     
     group | -1.516728   .6592741 |     Total
-----------+----------------------+----------
         0 |     84.62      15.38 |    100.00 
         1 |     81.08      18.92 |    100.00 
-----------+----------------------+----------
     Total |     83.15      16.85 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
     married |     .7028        .45704 |     .1892        .39272 |    1.20541
------------------------------------------------------------------------------

     =1 if |  Standardized values
 treatment |    of (nodeg)     
     group | -.6686902    1.49537 |     Total
-----------+----------------------+----------
         0 |     16.54      83.46 |    100.00 
         1 |     29.19      70.81 |    100.00 
-----------+----------------------+----------
     Total |     21.80      78.20 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
       nodeg |     .3045        .46019 |     .7081        .45587 |   -0.88127
------------------------------------------------------------------------------

. 
. *check balance of lagged dep var
. foreach var of varlist re74 re75 {
  2.         stddiff `var', by(treat)
  3. }

------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        re74 |     13826        9636.6 |      2096        4886.6 |    1.53540
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        re75 |     13453        9334.5 |      1532        3219.3 |    1.70734
------------------------------------------------------------------------------

. 
. *examine effect of treatment variable in sample
. reg re78 treat

      Source |       SS           df       MS      Number of obs   =    16,437
-------------+----------------------------------   F(1, 16435)     =    136.03
       Model |  1.2701e+10         1  1.2701e+10   Prob > F        =    0.0000
    Residual |  1.5346e+12    16,435    93373521   R-squared       =    0.0082
-------------+----------------------------------   Adj R-squared   =    0.0081
       Total |  1.5473e+12    16,436  94140607.2   Root MSE        =      9663

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |  -8332.867   714.4698   -11.66   0.000    -9733.305   -6932.428
       _cons |   14682.01   75.79812   193.70   0.000     14533.44    14830.58
------------------------------------------------------------------------------

. *************************************Q2*****************************************
. 
. *create a flag for CPS only treatment control
. gen treat2 = .
(16,437 missing values generated)

. replace treat2 = 1 if sample == 0 & treat == 1
(185 real changes made)

. replace treat2 = 0 if sample == 1 & treat == 0
(15,992 real changes made)

. 
. *check
. *tab treat2 sample
. 
. *check balance in control variables 
. foreach var of local vars {
  2.         tab treat2 `var'_std, nofreq row
  3.         stddiff `var', by(treat2)
  4.         }

           |           Standardized values of (age)     
    treat2 | -1.542267  -1.451613  -1.360958  -1.270304  -1.179649 |     Total
-----------+-------------------------------------------------------+----------
         0 |      2.11       2.47       2.98       2.91       2.84 |    100.00 
         1 |      0.00       7.03       7.03       6.49       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      2.09       2.52       3.02       2.95       2.86 |    100.00 


           |           Standardized values of (age)     
    treat2 | -1.088995  -.9983405  -.9076861  -.8170317  -.7263772 |     Total
-----------+-------------------------------------------------------+----------
         0 |      3.16       2.94       3.15       3.27       3.42 |    100.00 
         1 |      4.86       5.95       6.49       4.86       9.73 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      3.18       2.97       3.18       3.29       3.49 |    100.00 


           |           Standardized values of (age)     
    treat2 | -.6357228  -.5450683  -.4544139  -.3637594   -.273105 |     Total
-----------+-------------------------------------------------------+----------
         0 |      3.65       3.65       4.06       4.13       2.92 |    100.00 
         1 |      4.86       8.65       3.24       4.86       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      3.66       3.71       4.05       4.14       2.91 |    100.00 


           |           Standardized values of (age)     
    treat2 | -.1824505  -.0917961  -.0011417   .0895128   .1801672 |     Total
-----------+-------------------------------------------------------+----------
         0 |      2.86       2.94       2.84       2.66       2.41 |    100.00 
         1 |      3.78       0.54       2.70       0.00       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      2.87       2.91       2.84       2.63       2.40 |    100.00 


           |           Standardized values of (age)     
    treat2 |  .2708217   .3614761   .4521306    .542785   .6334395 |     Total
-----------+-------------------------------------------------------+----------
         0 |      2.27       2.10       2.16       2.02       1.95 |    100.00 
         1 |      0.00       1.08       1.62       0.00       1.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      2.24       2.09       2.16       2.00       1.94 |    100.00 


           |           Standardized values of (age)     
    treat2 |  .7240939   .8147483   .9054028   .9960572   1.086712 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.95       1.93       1.78       1.81       1.94 |    100.00 
         1 |      1.08       2.16       0.54       0.54       0.54 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.94       1.93       1.76       1.80       1.92 |    100.00 


           |           Standardized values of (age)     
    treat2 |  1.177366   1.268021   1.358675   1.449329   1.539984 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.83       1.94       1.89       1.86       1.91 |    100.00 
         1 |      1.62       0.00       0.54       0.00       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.83       1.92       1.88       1.84       1.89 |    100.00 


           |           Standardized values of (age)     
    treat2 |  1.630638   1.721293   1.811947   1.902602   1.993256 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.96       1.84       1.88       1.69       1.92 |    100.00 
         1 |      0.00       0.00       0.00       0.00       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.94       1.82       1.85       1.67       1.90 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         age |     33.23        11.045 |     25.82         7.155 |    0.79618
------------------------------------------------------------------------------

           |            Standardized values of (ed)     
    treat2 | -4.184457  -3.835109  -3.485761  -3.136414  -2.787066 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.23       0.09       0.25       0.46       0.60 |    100.00 
         1 |      0.00       0.00       0.00       0.00       2.16 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.22       0.09       0.25       0.45       0.62 |    100.00 


           |            Standardized values of (ed)     
    treat2 | -2.437718  -2.088371  -1.739023  -1.389675  -1.040328 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.69       1.41       1.74       5.33       5.13 |    100.00 
         1 |      1.62       0.54       1.08       9.73      15.14 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.70       1.40       1.73       5.38       5.25 |    100.00 


           |            Standardized values of (ed)     
    treat2 | -.6909802  -.3416325   .0077151   .3570628   .7064104 |     Total
-----------+-------------------------------------------------------+----------
         0 |      7.03       6.62      39.09       6.73       7.24 |    100.00 
         1 |     16.76      23.78      21.08       4.32       2.70 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      7.15       6.82      38.89       6.71       7.19 |    100.00 


           |      Standardized values of (ed)     
    treat2 |  1.055758   1.405106   1.754453   2.103801 |     Total
-----------+--------------------------------------------+----------
         0 |      2.96       8.55       2.08       3.76 |    100.00 
         1 |      0.54       0.54       0.00       0.00 |    100.00 
-----------+--------------------------------------------+----------
     Total |      2.93       8.46       2.06       3.72 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
          ed |     12.03        2.8708 |     10.35        2.0107 |    0.67850
------------------------------------------------------------------------------

           |  Standardized values
           |    of (black)     
    treat2 |  -.322318   3.102337 |     Total
-----------+----------------------+----------
         0 |     92.65       7.35 |    100.00 
         1 |     15.68      84.32 |    100.00 
-----------+----------------------+----------
     Total |     91.77       8.23 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
       black |    .07354        .26102 |     .8432        .36456 |   -2.42775
------------------------------------------------------------------------------

           |  Standardized values
           |    of (hisp)     
    treat2 |  -.279489   3.577741 |     Total
-----------+----------------------+----------
         0 |     92.80       7.20 |    100.00 
         1 |     94.05       5.95 |    100.00 
-----------+----------------------+----------
     Total |     92.81       7.19 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        hisp |    .07204        .25856 |    .05946        .23712 |    0.05070
------------------------------------------------------------------------------

           |  Standardized values
           |   of (married)     
    treat2 | -1.516728   .6592741 |     Total
-----------+----------------------+----------
         0 |     28.83      71.17 |    100.00 
         1 |     81.08      18.92 |    100.00 
-----------+----------------------+----------
     Total |     29.42      70.58 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
     married |     .7117        .45297 |     .1892        .39272 |    1.23265
------------------------------------------------------------------------------

           |  Standardized values
           |    of (nodeg)     
    treat2 | -.6686902    1.49537 |     Total
-----------+----------------------+----------
         0 |     70.42      29.58 |    100.00 
         1 |     29.19      70.81 |    100.00 
-----------+----------------------+----------
     Total |     69.94      30.06 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
       nodeg |     .2958        .45643 |     .7081        .45587 |   -0.90381
------------------------------------------------------------------------------

. 
. *check balance of lagged dep var
. foreach var of varlist re74 re75 {
  2.         stddiff `var', by(treat)
  3. }

------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        re74 |     13826        9636.6 |      2096        4886.6 |    1.53540
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        re75 |     13453        9334.5 |      1532        3219.3 |    1.70734
------------------------------------------------------------------------------

. 
.         
. *examine effect of treatment variable in sample
. reg re78 treat2 

      Source |       SS           df       MS      Number of obs   =    16,177
-------------+----------------------------------   F(1, 16175)     =    142.43
       Model |  1.3206e+10         1  1.3206e+10   Prob > F        =    0.0000
    Residual |  1.4997e+12    16,175    92717516   R-squared       =    0.0087
-------------+----------------------------------   Adj R-squared   =    0.0087
       Total |  1.5129e+12    16,176  93528158.7   Root MSE        =      9629

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      treat2 |  -8497.516   712.0207   -11.93   0.000    -9893.156   -7101.877
       _cons |   14846.66   76.14292   194.98   0.000     14697.41    14995.91
------------------------------------------------------------------------------

. 
. *************************************Q3*****************************************
. 
. *control for observables using CPS control group
. reg re78 `vars' re74 re75

      Source |       SS           df       MS      Number of obs   =    16,437
-------------+----------------------------------   F(8, 16428)     =   1905.79
       Model |  7.4479e+11         8  9.3098e+10   Prob > F        =    0.0000
    Residual |  8.0251e+11    16,428  48850093.1   R-squared       =    0.4813
-------------+----------------------------------   Adj R-squared   =    0.4811
       Total |  1.5473e+12    16,436  94140607.2   Root MSE        =    6989.3

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -99.58668   5.837643   -17.06   0.000    -111.0291   -88.14426
          ed |   156.9058   28.37296     5.53   0.000     101.2917    212.5199
       black |    -948.01   192.5634    -4.92   0.000    -1325.455   -570.5649
        hisp |  -203.0647   215.9951    -0.94   0.347    -626.4385    220.3092
     married |   63.10416   140.7105     0.45   0.654    -212.7036    338.9119
       nodeg |   322.9539    175.043     1.84   0.065    -20.14948    666.0572
        re74 |   .2841631   .0119689    23.74   0.000     .2607027    .3076236
        re75 |   .4739448   .0120695    39.27   0.000     .4502874    .4976022
       _cons |   5752.954   442.0577    13.01   0.000     4886.472    6619.435
------------------------------------------------------------------------------

. 
. 
. ************************************Q4******************************************
. 
. qui psmatch2 treat2 `vars' re74 re75

. ren _pscore pscore

. ren _support csupport

. 
. *check common support
. tab treat2 csupport

           | psmatch2:
           |   Common
           |  support
    treat2 | On suppor |     Total
-----------+-----------+----------
         0 |    15,992 |    15,992 
         1 |       185 |       185 
-----------+-----------+----------
     Total |    16,177 |    16,177 


. 
. *check common support
. bysort treat2: sum pscore, det

--------------------------------------------------------------------------------------
-> treat2 = 0

                 psmatch2: Propensity Score
-------------------------------------------------------------
      Percentiles      Smallest
 1%     4.11e-09       3.65e-09
 5%     5.41e-09       3.65e-09
10%     7.00e-09       3.65e-09       Obs              15,992
25%     9.82e-08       3.65e-09       Sum of Wgt.      15,992

50%     .0000163                      Mean           .0086368
                        Largest       Std. Dev.       .040973
75%     .0012166       .4248358
90%     .0108586       .4261508       Variance       .0016788
95%     .0213491       .4261508       Skewness       7.186144
99%     .2484297       .4274667       Kurtosis       59.78498

--------------------------------------------------------------------------------------
-> treat2 = 1

                 psmatch2: Propensity Score
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0006522       .0003183
 5%     .0046371       .0006522
10%     .0128337       .0006797       Obs                 185
25%     .1504563       .0011636       Sum of Wgt.         185

50%     .2558979                      Mean           .2527716
                        Largest       Std. Dev.      .1429539
75%     .3988329       .4235216
90%     .4169636       .4248358       Variance       .0204358
95%     .4208958       .4261508       Skewness      -.4522729
99%     .4261508       .4261508       Kurtosis       1.974414

--------------------------------------------------------------------------------------
-> treat2 = .

                 psmatch2: Propensity Score
-------------------------------------------------------------
no observations


. 
. 
. *manually calculate pscore and check common support
. logit treat2 `var' re74 re75

Iteration 0:   log likelihood = -1011.0713  
Iteration 1:   log likelihood = -900.51926  
Iteration 2:   log likelihood = -816.77858  
Iteration 3:   log likelihood = -807.51065  
Iteration 4:   log likelihood = -807.12507  
Iteration 5:   log likelihood = -807.12363  
Iteration 6:   log likelihood = -807.12363  

Logistic regression                             Number of obs     =     16,177
                                                LR chi2(2)        =     407.90
                                                Prob > chi2       =     0.0000
Log likelihood = -807.12363                     Pseudo R2         =     0.2017

------------------------------------------------------------------------------
      treat2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        re74 |  -.0000694   .0000224    -3.10   0.002    -.0001133   -.0000255
        re75 |  -.0002215   .0000309    -7.16   0.000    -.0002821   -.0001609
       _cons |  -2.857019   .0875781   -32.62   0.000    -3.028669   -2.685369
------------------------------------------------------------------------------

. predict pscore_m
(option pr assumed; Pr(treat2))

. 
. *check common support
. bysort treat2: sum pscore_m, det

--------------------------------------------------------------------------------------
-> treat2 = 0

                         Pr(treat2)
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0000356       .0000356
 5%     .0000356       .0000356
10%     .0000356       .0000356       Obs              15,992
25%     .0000773       .0000356       Sum of Wgt.      15,992

50%     .0008319                      Mean           .0110802
                        Largest       Std. Dev.      .0180252
75%     .0140764       .0543196
90%     .0485223       .0543196       Variance       .0003249
95%     .0543196       .0543196       Skewness       1.520561
99%     .0543196       .0543196       Kurtosis       3.756321

--------------------------------------------------------------------------------------
-> treat2 = 1

                         Pr(treat2)
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .000392       .0000792
 5%     .0080184        .000392
10%     .0116168       .0004131       Obs                 185
25%     .0302621       .0010434       Sum of Wgt.         185

50%     .0543196                      Mean           .0421933
                        Largest       Std. Dev.      .0173535
75%     .0543196       .0543196
90%     .0543196       .0543196       Variance       .0003011
95%     .0543196       .0543196       Skewness      -1.076277
99%     .0543196       .0543196       Kurtosis       2.638778

--------------------------------------------------------------------------------------
-> treat2 = .

                         Pr(treat2)
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0004068       .0000587
 5%     .0053753       .0002419
10%     .0106767       .0004068       Obs                 260
25%     .0407108       .0007904       Sum of Wgt.         260

50%     .0543196                      Mean           .0447184
                        Largest       Std. Dev.      .0167528
75%     .0543196       .0543196
90%     .0543196       .0543196       Variance       .0002807
95%     .0543196       .0543196       Skewness       -1.55949
99%     .0543196       .0543196       Kurtosis       3.924221


. 
. *graphical check
. /*
> graph twoway \\\
>         (kdensity pscore if treat2 == 1) \\\
>         (kdensity pscore if treat2 == 0 & pscore > .003)
> */
. 
. *manual common support
. egen min_pscm_t = min(pscore_m) if treat == 1
(16252 missing values generated)

. egen min_pscm = min(min_pscm_t)

. gen csupport_m = 1

. replace csupport_m = 0 if pscore_m < min_pscm
(4,045 real changes made)

. tab csupport_m

 csupport_m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,045       24.61       24.61
          1 |     12,392       75.39      100.00
------------+-----------------------------------
      Total |     16,437      100.00

. 
. drop _*

. 
. ************************************Q6******************************************
. 
. *propensity score matching estimation
. psmatch2 treat2 `vars' re74 re75, out(re78) ate common

Probit regression                               Number of obs     =     16,177
                                                LR chi2(8)        =    1007.09
                                                Prob > chi2       =     0.0000
Log likelihood = -507.52755                     Pseudo R2         =     0.4980

------------------------------------------------------------------------------
      treat2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   -.003355   .0049515    -0.68   0.498    -.0130598    .0063498
          ed |   .0133306   .0234501     0.57   0.570    -.0326308     .059292
       black |   1.895501   .1023305    18.52   0.000     1.694937    2.096065
        hisp |   .7146045    .157952     4.52   0.000     .4050243    1.024185
     married |  -.4599528   .1109766    -4.14   0.000    -.6774629   -.2424427
       nodeg |   .4663277   .1294936     3.60   0.000      .212525    .7201305
        re74 |  -.0000133   .0000119    -1.12   0.262    -.0000366    9.98e-06
        re75 |  -.0000919   .0000151    -6.09   0.000    -.0001215   -.0000623
       _cons |  -2.634258   .3765225    -7.00   0.000    -3.372228   -1.896287
------------------------------------------------------------------------------
--------------------------------------------------------------------------------------
> --
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-st
> at
----------------------------+---------------------------------------------------------
> --
            re78  Unmatched |  6349.1435   14846.6597  -8497.51615    712.02072   -11.
> 93
                        ATT |  6349.1435   5080.31204   1268.83147   919.010032     1.
> 38
                        ATU | 7758.63229   8077.94212   319.309835            .       
>  .
                        ATE |                            349.33231            .       
>  .
----------------------------+---------------------------------------------------------
> --
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |    10,326      5,666 |    15,992 
   Treated |         0        185 |       185 
-----------+----------------------+----------
     Total |    10,326      5,851 |    16,177 


. 
. *examine ATE, ATT, ATU
. 
. di "------------Average Treatment Effects------------------"
------------Average Treatment Effects------------------

. di `r(ate)'
349.33231

. 
. di "------------Average Treatment On Treat-----------------"
------------Average Treatment On Treat-----------------

. di `r(att)'
1268.8315

. 
. di "------------Average Treatment On Untreated-------------"
------------Average Treatment On Untreated-------------

. di `r(atu)'
319.30984

. 
. 
. *repeat using teffects pscore matching 
. teffects psmatch (re78) (treat2 `vars'), ate

Treatment-effects estimation                   Number of obs      =     16,177
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =        138
------------------------------------------------------------------------------
             |              AI Robust
        re78 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATE          |
      treat2 |
   (1 vs 0)  |  -8373.705   3394.836    -2.47   0.014    -15027.46   -1719.949
------------------------------------------------------------------------------

. teffects psmatch (re78) (treat2 `vars'), atet

Treatment-effects estimation                   Number of obs      =     16,177
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =        138
------------------------------------------------------------------------------
             |              AI Robust
        re78 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
      treat2 |
   (1 vs 0)  |  -3298.223   971.9984    -3.39   0.001    -5203.305   -1393.142
------------------------------------------------------------------------------

. 
. 
. *repeat excercise using Angrist (2009) restriction
. keep if pscore > .1
(15,632 observations deleted)

. keep if pscore < .9
(260 observations deleted)

. 
. psmatch2 treat2 `vars' re74 re75, out(re78) ate common
note: black omitted because of collinearity
note: hisp omitted because of collinearity

Probit regression                               Number of obs     =        545
                                                LR chi2(6)        =      51.34
                                                Prob > chi2       =     0.0000
Log likelihood =  -295.0022                     Pseudo R2         =     0.0801

------------------------------------------------------------------------------
      treat2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0021103     .00684    -0.31   0.758    -.0155164    .0112959
          ed |    .036359   .0338223     1.08   0.282    -.0299314    .1026494
       black |          0  (omitted)
        hisp |          0  (omitted)
     married |  -.5695234   .1625371    -3.50   0.000    -.8880904   -.2509565
       nodeg |    .709363   .1811851     3.92   0.000     .3542466    1.064479
        re74 |  -.0000118   .0000189    -0.62   0.533    -.0000488    .0000252
        re75 |  -.0001084   .0000371    -2.92   0.003    -.0001812   -.0000357
       _cons |  -1.072496   .5260253    -2.04   0.041    -2.103486    -.041505
------------------------------------------------------------------------------
--------------------------------------------------------------------------------------
> --
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-st
> at
----------------------------+---------------------------------------------------------
> --
            re78  Unmatched | 5883.12655   4715.98294   1167.14361   647.905199     1.
> 80
                        ATT | 5883.12655   4482.11216   1401.01439   1025.48789     1.
> 37
                        ATU | 4711.51682   6890.38349   2178.86668            .       
>  .
                        ATE |                           1961.18413            .       
>  .
----------------------------+---------------------------------------------------------
> --
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         9        386 |       395 
   Treated |         0        150 |       150 
-----------+----------------------+----------
     Total |         9        536 |       545 


. 
. ********************************************************************************
. 
. 
. 
. 
. 
. cap restore not

. cap log close
