
. 
. 
. cd `dataPATH'
C:\Users\fcoca\Downloads

. use `data', clear

. 
. **************************************Q1*************************************
> ***
. preserve

. 
. keep if sample == 0
(15,992 observations deleted)

. 
. 
. *standardize control variables and check balance 
. foreach var of local vars {
  2.         egen `var'_std = std(`var')
  3.         tab treat `var'_std if sample == 0, nofreq row
  4.         stddiff `var', by(treat)
  5. }

     =1 if |
 treatment |           Standardized values of (age)     
     group | -1.178937  -1.038098  -.8972582  -.7564187  -.6155792 |     Total
-----------+-------------------------------------------------------+----------
         0 |      8.08      10.00       8.08       5.77       3.85 |    100.00 
         1 |      7.03       7.03       6.49       4.86       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      7.64       8.76       7.42       5.39       4.27 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group | -.4747398  -.3339003  -.1930608  -.0522214   .0886181 |     Total
-----------+-------------------------------------------------------+----------
         0 |      6.15       5.77       5.77       8.46       4.62 |    100.00 
         1 |      5.95       6.49       4.86       9.73       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      6.07       6.07       5.39       8.99       4.72 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group |  .2294576    .370297   .5111365    .651976   .7928154 |     Total
-----------+-------------------------------------------------------+----------
         0 |      4.23       5.77       3.85       1.54       3.08 |    100.00 
         1 |      8.65       3.24       4.86       1.62       3.78 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      6.07       4.72       4.27       1.57       3.37 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group |  .9336549   1.074494   1.215334   1.356173   1.497013 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.54       1.92       2.31       0.77       1.54 |    100.00 
         1 |      0.54       2.70       0.00       1.62       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.12       2.25       1.35       1.12       0.90 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group |  1.637852   1.778692   1.919531   2.060371    2.20121 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.00       1.15       1.92       0.00       0.00 |    100.00 
         1 |      1.08       1.62       0.00       1.08       1.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.45       1.35       1.12       0.45       0.45 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group |   2.34205   2.482889   2.623729   2.764568   2.905407 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.38       0.38       1.15       0.77       0.00 |    100.00 
         1 |      2.16       0.54       0.54       0.54       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.12       0.45       0.90       0.67       0.67 |    100.00 


     =1 if |
 treatment |      Standardized values of (age)     
     group |  3.187086   3.468765   4.032123   4.172963 |     Total
-----------+--------------------------------------------+----------
         0 |      0.00       0.38       0.38       0.38 |    100.00 
         1 |      0.54       0.00       0.00       0.00 |    100.00 
-----------+--------------------------------------------+----------
     Total |      0.22       0.22       0.22       0.22 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         age |     25.05        7.0577 |     25.82         7.155 |   -0.10728
------------------------------------------------------------------------------

     =1 if |
 treatment |           Standardized values of (age2)     
     group | -.9422863  -.8608496  -.7747595  -.6840158  -.5886185 |     Total
-----------+-------------------------------------------------------+----------
         0 |      8.08      10.00       8.08       5.77       3.85 |    100.00 
         1 |      7.03       7.03       6.49       4.86       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      7.64       8.76       7.42       5.39       4.27 |    100.00 


     =1 if |
 treatment |           Standardized values of (age2)     
     group | -.4885677  -.3838634  -.2745056  -.1604943  -.0418294 |     Total
-----------+-------------------------------------------------------+----------
         0 |      6.15       5.77       5.77       8.46       4.62 |    100.00 
         1 |      5.95       6.49       4.86       9.73       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      6.07       6.07       5.39       8.99       4.72 |    100.00 


     =1 if |
 treatment |           Standardized values of (age2)     
     group |   .081489   .2094609   .3420863   .4793653   .6212977 |     Total
-----------+-------------------------------------------------------+----------
         0 |      4.23       5.77       3.85       1.54       3.08 |    100.00 
         1 |      8.65       3.24       4.86       1.62       3.78 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      6.07       4.72       4.27       1.57       3.37 |    100.00 


     =1 if |
 treatment |           Standardized values of (age2)     
     group |  .7678837   .9191233   1.075016   1.235563   1.400763 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.54       1.92       2.31       0.77       1.54 |    100.00 
         1 |      0.54       2.70       0.00       1.62       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.12       2.25       1.35       1.12       0.90 |    100.00 


     =1 if |
 treatment |           Standardized values of (age2)     
     group |  1.570617   1.745124   1.924284   2.108099   2.296566 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.00       1.15       1.92       0.00       0.00 |    100.00 
         1 |      1.08       1.62       0.00       1.08       1.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.45       1.35       1.12       0.45       0.45 |    100.00 


     =1 if |
 treatment |           Standardized values of (age2)     
     group |  2.489688   2.687462   2.889891   3.096972   3.308708 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.38       0.38       1.15       0.77       0.00 |    100.00 
         1 |      2.16       0.54       0.54       0.54       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.12       0.45       0.90       0.67       0.67 |    100.00 


     =1 if |
 treatment |     Standardized values of (age2)     
     group |  3.746139   4.202184   5.170117   5.423735 |     Total
-----------+--------------------------------------------+----------
         0 |      0.00       0.38       0.38       0.38 |    100.00 
         1 |      0.54       0.00       0.00       0.00 |    100.00 
-----------+--------------------------------------------+----------
     Total |      0.22       0.22       0.22       0.22 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        age2 |     677.3        428.78 |     717.4        431.25 |   -0.09320
------------------------------------------------------------------------------

     =1 if |
 treatment |            Standardized values of (ed)     
     group | -4.015082  -3.457083  -2.899085  -2.341086  -1.783088 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.38       0.38       0.77       1.54       2.69 |    100.00 
         1 |      0.00       2.16       1.62       0.54       1.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.22       1.12       1.12       1.12       2.02 |    100.00 


     =1 if |
 treatment |            Standardized values of (ed)     
     group | -1.225089  -.6670904  -.1090919   .4489067   1.006905 |     Total
-----------+-------------------------------------------------------+----------
         0 |      8.08      15.38      27.31      26.92      13.85 |    100.00 
         1 |      9.73      15.14      16.76      23.78      21.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      8.76      15.28      22.92      25.62      16.85 |    100.00 


     =1 if |
 treatment |      Standardized values of (ed)     
     group |  1.564904   2.122902   2.680901     3.2389 |     Total
-----------+--------------------------------------------+----------
         0 |      1.92       0.77       0.00       0.00 |    100.00 
         1 |      4.32       2.70       0.54       0.54 |    100.00 
-----------+--------------------------------------------+----------
     Total |      2.92       1.57       0.22       0.22 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
          ed |     10.09        1.6143 |     10.35        2.0107 |   -0.14122
------------------------------------------------------------------------------

     =1 if |  Standardized values
 treatment |    of (black)     
     group |  -2.23657   .4461084 |     Total
-----------+----------------------+----------
         0 |     17.31      82.69 |    100.00 
         1 |     15.68      84.32 |    100.00 
-----------+----------------------+----------
     Total |     16.63      83.37 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
       black |     .8269        .37904 |     .8432        .36456 |   -0.04389
------------------------------------------------------------------------------

     =1 if |  Standardized values
 treatment |    of (hisp)     
     group | -.3095856   3.222866 |     Total
-----------+----------------------+----------
         0 |     89.23      10.77 |    100.00 
         1 |     94.05       5.95 |    100.00 
-----------+----------------------+----------
     Total |     91.24       8.76 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        hisp |     .1077        .31059 |    .05946        .23712 |    0.17456
------------------------------------------------------------------------------

     =1 if |  Standardized values
 treatment |   of (married)     
     group |  -.449719   2.218614 |     Total
-----------+----------------------+----------
         0 |     84.62      15.38 |    100.00 
         1 |     81.08      18.92 |    100.00 
-----------+----------------------+----------
     Total |     83.15      16.85 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
     married |     .1538         .3615 |     .1892        .39272 |   -0.09364
------------------------------------------------------------------------------

     =1 if |  Standardized values
 treatment |    of (nodeg)     
     group | -1.891974   .5273607 |     Total
-----------+----------------------+----------
         0 |     16.54      83.46 |    100.00 
         1 |     29.19      70.81 |    100.00 
-----------+----------------------+----------
     Total |     21.80      78.20 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
       nodeg |     .8346        .37224 |     .7081        .45587 |    0.30399
------------------------------------------------------------------------------

. 
. *check balance of lagged dep var
. foreach var of varlist re74 re75 {
  2.         stddiff `var', by(treat)
  3. }

------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        re74 |      2107        5687.9 |      2096        4886.6 |    0.00216
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        re75 |      1267          3103 |      1532        3219.3 |   -0.08386
------------------------------------------------------------------------------

. 
. *examine effect of treatment variable in sample
. reg re78 treat

      Source |       SS           df       MS      Number of obs   =       445
-------------+----------------------------------   F(1, 443)       =      8.04
       Model |   348013183         1   348013183   Prob > F        =    0.0048
    Residual |  1.9178e+10       443  43290369.3   R-squared       =    0.0178
-------------+----------------------------------   Adj R-squared   =    0.0156
       Total |  1.9526e+10       444  43976681.9   Root MSE        =    6579.5

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1794.342   632.8534     2.84   0.005     550.5745     3038.11
       _cons |   4554.801   408.0459    11.16   0.000     3752.855    5356.747
------------------------------------------------------------------------------

. reg re78 treat re75

      Source |       SS           df       MS      Number of obs   =       445
-------------+----------------------------------   F(2, 442)       =      5.45
       Model |   470256643         2   235128321   Prob > F        =    0.0046
    Residual |  1.9055e+10       442  43111742.4   R-squared       =    0.0241
-------------+----------------------------------   Adj R-squared   =    0.0197
       Total |  1.9526e+10       444  43976681.9   Root MSE        =      6566

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1750.151   632.0914     2.77   0.006     507.8728    2992.429
        re75 |   .1666683   .0989778     1.68   0.093    -.0278574    .3611939
       _cons |   4343.648   426.0734    10.19   0.000     3506.266    5181.029
------------------------------------------------------------------------------

. reg re78 treat `vars' re75 re74

      Source |       SS           df       MS      Number of obs   =       445
-------------+----------------------------------   F(10, 434)      =      2.53
       Model |  1.0749e+09        10   107492486   Prob > F        =    0.0057
    Residual |  1.8451e+10       434  42513184.1   R-squared       =    0.0551
-------------+----------------------------------   Adj R-squared   =    0.0333
       Total |  1.9526e+10       444  43976681.9   Root MSE        =    6520.2

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1675.862   639.3441     2.62   0.009     419.2667    2932.458
         age |   141.7306   274.4174     0.52   0.606    -397.6218     681.083
        age2 |  -1.435322   4.495413    -0.32   0.750    -10.27081    7.400166
          ed |   385.0161   230.1116     1.67   0.095    -67.25567    837.2879
       black |  -2155.641   1170.308    -1.84   0.066    -4455.817    144.5339
        hisp |   187.2627   1552.764     0.12   0.904     -2864.61    3239.136
     married |  -184.8944   892.4303    -0.21   0.836    -1938.917    1569.128
       nodeg |  -55.54479   1006.542    -0.06   0.956    -2033.849    1922.759
        re75 |   .0508152   .1357532     0.37   0.708    -.2160002    .3176306
        re74 |   .0814752   .0775297     1.05   0.294    -.0709052    .2338557
       _cons |  -307.0121   4807.584    -0.06   0.949    -9756.054     9142.03
------------------------------------------------------------------------------

. restore

. BREAK!
command BREAK is unrecognized
r(199);

end of do-file

r(199);

