
. 
. 
. cd `dataPATH'
C:\Users\fcoca\Downloads

. use `data', clear

. 
. **************************************Q1*************************************
> ***
. preserve

. 
. keep if sample == 0
(15,992 observations deleted)

. 
. 
. *standardize control variables and check balance 
. foreach var of local vars {
  2.         egen `var'_std = std(`var')
  3.         tab treat `var'_std if sample == 0, nofreq row
  4.         stddiff `var', by(treat)
  5. }

     =1 if |
 treatment |           Standardized values of (age)     
     group | -1.178937  -1.038098  -.8972582  -.7564187  -.6155792 |     Total
-----------+-------------------------------------------------------+----------
         0 |      8.08      10.00       8.08       5.77       3.85 |    100.00 
         1 |      7.03       7.03       6.49       4.86       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      7.64       8.76       7.42       5.39       4.27 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group | -.4747398  -.3339003  -.1930608  -.0522214   .0886181 |     Total
-----------+-------------------------------------------------------+----------
         0 |      6.15       5.77       5.77       8.46       4.62 |    100.00 
         1 |      5.95       6.49       4.86       9.73       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      6.07       6.07       5.39       8.99       4.72 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group |  .2294576    .370297   .5111365    .651976   .7928154 |     Total
-----------+-------------------------------------------------------+----------
         0 |      4.23       5.77       3.85       1.54       3.08 |    100.00 
         1 |      8.65       3.24       4.86       1.62       3.78 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      6.07       4.72       4.27       1.57       3.37 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group |  .9336549   1.074494   1.215334   1.356173   1.497013 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.54       1.92       2.31       0.77       1.54 |    100.00 
         1 |      0.54       2.70       0.00       1.62       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.12       2.25       1.35       1.12       0.90 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group |  1.637852   1.778692   1.919531   2.060371    2.20121 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.00       1.15       1.92       0.00       0.00 |    100.00 
         1 |      1.08       1.62       0.00       1.08       1.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.45       1.35       1.12       0.45       0.45 |    100.00 


     =1 if |
 treatment |           Standardized values of (age)     
     group |   2.34205   2.482889   2.623729   2.764568   2.905407 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.38       0.38       1.15       0.77       0.00 |    100.00 
         1 |      2.16       0.54       0.54       0.54       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.12       0.45       0.90       0.67       0.67 |    100.00 


     =1 if |
 treatment |      Standardized values of (age)     
     group |  3.187086   3.468765   4.032123   4.172963 |     Total
-----------+--------------------------------------------+----------
         0 |      0.00       0.38       0.38       0.38 |    100.00 
         1 |      0.54       0.00       0.00       0.00 |    100.00 
-----------+--------------------------------------------+----------
     Total |      0.22       0.22       0.22       0.22 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         age |     25.05        7.0577 |     25.82         7.155 |   -0.10728
------------------------------------------------------------------------------

     =1 if |
 treatment |           Standardized values of (age2)     
     group | -.9422863  -.8608496  -.7747595  -.6840158  -.5886185 |     Total
-----------+-------------------------------------------------------+----------
         0 |      8.08      10.00       8.08       5.77       3.85 |    100.00 
         1 |      7.03       7.03       6.49       4.86       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      7.64       8.76       7.42       5.39       4.27 |    100.00 


     =1 if |
 treatment |           Standardized values of (age2)     
     group | -.4885677  -.3838634  -.2745056  -.1604943  -.0418294 |     Total
-----------+-------------------------------------------------------+----------
         0 |      6.15       5.77       5.77       8.46       4.62 |    100.00 
         1 |      5.95       6.49       4.86       9.73       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      6.07       6.07       5.39       8.99       4.72 |    100.00 


     =1 if |
 treatment |           Standardized values of (age2)     
     group |   .081489   .2094609   .3420863   .4793653   .6212977 |     Total
-----------+-------------------------------------------------------+----------
         0 |      4.23       5.77       3.85       1.54       3.08 |    100.00 
         1 |      8.65       3.24       4.86       1.62       3.78 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      6.07       4.72       4.27       1.57       3.37 |    100.00 


     =1 if |
 treatment |           Standardized values of (age2)     
     group |  .7678837   .9191233   1.075016   1.235563   1.400763 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.54       1.92       2.31       0.77       1.54 |    100.00 
         1 |      0.54       2.70       0.00       1.62       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.12       2.25       1.35       1.12       0.90 |    100.00 


     =1 if |
 treatment |           Standardized values of (age2)     
     group |  1.570617   1.745124   1.924284   2.108099   2.296566 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.00       1.15       1.92       0.00       0.00 |    100.00 
         1 |      1.08       1.62       0.00       1.08       1.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.45       1.35       1.12       0.45       0.45 |    100.00 


     =1 if |
 treatment |           Standardized values of (age2)     
     group |  2.489688   2.687462   2.889891   3.096972   3.308708 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.38       0.38       1.15       0.77       0.00 |    100.00 
         1 |      2.16       0.54       0.54       0.54       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.12       0.45       0.90       0.67       0.67 |    100.00 


     =1 if |
 treatment |     Standardized values of (age2)     
     group |  3.746139   4.202184   5.170117   5.423735 |     Total
-----------+--------------------------------------------+----------
         0 |      0.00       0.38       0.38       0.38 |    100.00 
         1 |      0.54       0.00       0.00       0.00 |    100.00 
-----------+--------------------------------------------+----------
     Total |      0.22       0.22       0.22       0.22 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        age2 |     677.3        428.78 |     717.4        431.25 |   -0.09320
------------------------------------------------------------------------------

     =1 if |
 treatment |            Standardized values of (ed)     
     group | -4.015082  -3.457083  -2.899085  -2.341086  -1.783088 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.38       0.38       0.77       1.54       2.69 |    100.00 
         1 |      0.00       2.16       1.62       0.54       1.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.22       1.12       1.12       1.12       2.02 |    100.00 


     =1 if |
 treatment |            Standardized values of (ed)     
     group | -1.225089  -.6670904  -.1090919   .4489067   1.006905 |     Total
-----------+-------------------------------------------------------+----------
         0 |      8.08      15.38      27.31      26.92      13.85 |    100.00 
         1 |      9.73      15.14      16.76      23.78      21.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      8.76      15.28      22.92      25.62      16.85 |    100.00 


     =1 if |
 treatment |      Standardized values of (ed)     
     group |  1.564904   2.122902   2.680901     3.2389 |     Total
-----------+--------------------------------------------+----------
         0 |      1.92       0.77       0.00       0.00 |    100.00 
         1 |      4.32       2.70       0.54       0.54 |    100.00 
-----------+--------------------------------------------+----------
     Total |      2.92       1.57       0.22       0.22 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
          ed |     10.09        1.6143 |     10.35        2.0107 |   -0.14122
------------------------------------------------------------------------------

     =1 if |  Standardized values
 treatment |    of (black)     
     group |  -2.23657   .4461084 |     Total
-----------+----------------------+----------
         0 |     17.31      82.69 |    100.00 
         1 |     15.68      84.32 |    100.00 
-----------+----------------------+----------
     Total |     16.63      83.37 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
       black |     .8269        .37904 |     .8432        .36456 |   -0.04389
------------------------------------------------------------------------------

     =1 if |  Standardized values
 treatment |    of (hisp)     
     group | -.3095856   3.222866 |     Total
-----------+----------------------+----------
         0 |     89.23      10.77 |    100.00 
         1 |     94.05       5.95 |    100.00 
-----------+----------------------+----------
     Total |     91.24       8.76 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        hisp |     .1077        .31059 |    .05946        .23712 |    0.17456
------------------------------------------------------------------------------

     =1 if |  Standardized values
 treatment |   of (married)     
     group |  -.449719   2.218614 |     Total
-----------+----------------------+----------
         0 |     84.62      15.38 |    100.00 
         1 |     81.08      18.92 |    100.00 
-----------+----------------------+----------
     Total |     83.15      16.85 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
     married |     .1538         .3615 |     .1892        .39272 |   -0.09364
------------------------------------------------------------------------------

     =1 if |  Standardized values
 treatment |    of (nodeg)     
     group | -1.891974   .5273607 |     Total
-----------+----------------------+----------
         0 |     16.54      83.46 |    100.00 
         1 |     29.19      70.81 |    100.00 
-----------+----------------------+----------
     Total |     21.80      78.20 |    100.00 


------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
       nodeg |     .8346        .37224 |     .7081        .45587 |    0.30399
------------------------------------------------------------------------------

. 
. *check balance of lagged dep var
. foreach var of varlist re74 re75 {
  2.         stddiff `var', by(treat)
  3. }

------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        re74 |      2107        5687.9 |      2096        4886.6 |    0.00216
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        re75 |      1267          3103 |      1532        3219.3 |   -0.08386
------------------------------------------------------------------------------

. 
. *examine effect of treatment variable in sample
. reg re78 treat

      Source |       SS           df       MS      Number of obs   =       445
-------------+----------------------------------   F(1, 443)       =      8.04
       Model |   348013183         1   348013183   Prob > F        =    0.0048
    Residual |  1.9178e+10       443  43290369.3   R-squared       =    0.0178
-------------+----------------------------------   Adj R-squared   =    0.0156
       Total |  1.9526e+10       444  43976681.9   Root MSE        =    6579.5

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1794.342   632.8534     2.84   0.005     550.5745     3038.11
       _cons |   4554.801   408.0459    11.16   0.000     3752.855    5356.747
------------------------------------------------------------------------------

. reg re78 treat re75

      Source |       SS           df       MS      Number of obs   =       445
-------------+----------------------------------   F(2, 442)       =      5.45
       Model |   470256643         2   235128321   Prob > F        =    0.0046
    Residual |  1.9055e+10       442  43111742.4   R-squared       =    0.0241
-------------+----------------------------------   Adj R-squared   =    0.0197
       Total |  1.9526e+10       444  43976681.9   Root MSE        =      6566

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1750.151   632.0914     2.77   0.006     507.8728    2992.429
        re75 |   .1666683   .0989778     1.68   0.093    -.0278574    .3611939
       _cons |   4343.648   426.0734    10.19   0.000     3506.266    5181.029
------------------------------------------------------------------------------

. reg re78 treat `vars' re75 re74

      Source |       SS           df       MS      Number of obs   =       445
-------------+----------------------------------   F(10, 434)      =      2.53
       Model |  1.0749e+09        10   107492486   Prob > F        =    0.0057
    Residual |  1.8451e+10       434  42513184.1   R-squared       =    0.0551
-------------+----------------------------------   Adj R-squared   =    0.0333
       Total |  1.9526e+10       444  43976681.9   Root MSE        =    6520.2

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1675.862   639.3441     2.62   0.009     419.2667    2932.458
         age |   141.7306   274.4174     0.52   0.606    -397.6218     681.083
        age2 |  -1.435322   4.495413    -0.32   0.750    -10.27081    7.400166
          ed |   385.0161   230.1116     1.67   0.095    -67.25567    837.2879
       black |  -2155.641   1170.308    -1.84   0.066    -4455.817    144.5339
        hisp |   187.2627   1552.764     0.12   0.904     -2864.61    3239.136
     married |  -184.8944   892.4303    -0.21   0.836    -1938.917    1569.128
       nodeg |  -55.54479   1006.542    -0.06   0.956    -2033.849    1922.759
        re75 |   .0508152   .1357532     0.37   0.708    -.2160002    .3176306
        re74 |   .0814752   .0775297     1.05   0.294    -.0709052    .2338557
       _cons |  -307.0121   4807.584    -0.06   0.949    -9756.054     9142.03
------------------------------------------------------------------------------

. restore

. 
. *************************************Q2**************************************
> ***
. 
. *create a flag for CPS only treatment control
. gen treat2 = .
(16,437 missing values generated)

. replace treat2 = 1 if sample == 0 & treat == 1
(185 real changes made)

. replace treat2 = 0 if sample == 1 & treat == 0
(15,992 real changes made)

. 
. *check
. *tab treat2 sample
. 
. *check balance in control variables 
. foreach var of local vars {
  2.         egen `var'_std = std(`var')
  3.         tab treat2 `var'_std, nofreq row
  4.         stddiff `var', by(treat2)
  5.         }

           |           Standardized values of (age)     
    treat2 | -1.542267  -1.451613  -1.360958  -1.270304  -1.179649 |     Total
-----------+-------------------------------------------------------+----------
         0 |      2.11       2.47       2.98       2.91       2.84 |    100.00 
         1 |      0.00       7.03       7.03       6.49       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      2.09       2.52       3.02       2.95       2.86 |    100.00 


           |           Standardized values of (age)     
    treat2 | -1.088995  -.9983405  -.9076861  -.8170317  -.7263772 |     Total
-----------+-------------------------------------------------------+----------
         0 |      3.16       2.94       3.15       3.27       3.42 |    100.00 
         1 |      4.86       5.95       6.49       4.86       9.73 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      3.18       2.97       3.18       3.29       3.49 |    100.00 


           |           Standardized values of (age)     
    treat2 | -.6357228  -.5450683  -.4544139  -.3637594   -.273105 |     Total
-----------+-------------------------------------------------------+----------
         0 |      3.65       3.65       4.06       4.13       2.92 |    100.00 
         1 |      4.86       8.65       3.24       4.86       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      3.66       3.71       4.05       4.14       2.91 |    100.00 


           |           Standardized values of (age)     
    treat2 | -.1824505  -.0917961  -.0011417   .0895128   .1801672 |     Total
-----------+-------------------------------------------------------+----------
         0 |      2.86       2.94       2.84       2.66       2.41 |    100.00 
         1 |      3.78       0.54       2.70       0.00       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      2.87       2.91       2.84       2.63       2.40 |    100.00 


           |           Standardized values of (age)     
    treat2 |  .2708217   .3614761   .4521306    .542785   .6334395 |     Total
-----------+-------------------------------------------------------+----------
         0 |      2.27       2.10       2.16       2.02       1.95 |    100.00 
         1 |      0.00       1.08       1.62       0.00       1.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      2.24       2.09       2.16       2.00       1.94 |    100.00 


           |           Standardized values of (age)     
    treat2 |  .7240939   .8147483   .9054028   .9960572   1.086712 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.95       1.93       1.78       1.81       1.94 |    100.00 
         1 |      1.08       2.16       0.54       0.54       0.54 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.94       1.93       1.76       1.80       1.92 |    100.00 


           |           Standardized values of (age)     
    treat2 |  1.177366   1.268021   1.358675   1.449329   1.539984 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.83       1.94       1.89       1.86       1.91 |    100.00 
         1 |      1.62       0.00       0.54       0.00       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.83       1.92       1.88       1.84       1.89 |    100.00 


           |           Standardized values of (age)     
    treat2 |  1.630638   1.721293   1.811947   1.902602   1.993256 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.96       1.84       1.88       1.69       1.92 |    100.00 
         1 |      0.00       0.00       0.00       0.00       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.94       1.82       1.85       1.67       1.90 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         age |     33.23        11.045 |     25.82         7.155 |    0.79618
------------------------------------------------------------------------------

           |           Standardized values of (age2)     
    treat2 | -1.221813  -1.179615  -1.134861  -1.087548  -1.037679 |     Total
-----------+-------------------------------------------------------+----------
         0 |      2.11       2.47       2.98       2.91       2.84 |    100.00 
         1 |      0.00       7.03       7.03       6.49       4.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      2.09       2.52       3.02       2.95       2.86 |    100.00 


           |           Standardized values of (age2)     
    treat2 | -.9852515   -.930267  -.8727251  -.8126258   -.749969 |     Total
-----------+-------------------------------------------------------+----------
         0 |      3.16       2.94       3.15       3.27       3.42 |    100.00 
         1 |      4.86       5.95       6.49       4.86       9.73 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      3.18       2.97       3.18       3.29       3.49 |    100.00 


           |           Standardized values of (age2)     
    treat2 | -.6847548  -.6169832  -.5466542  -.4737678  -.3983239 |     Total
-----------+-------------------------------------------------------+----------
         0 |      3.65       3.65       4.06       4.13       2.92 |    100.00 
         1 |      4.86       8.65       3.24       4.86       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      3.66       3.71       4.05       4.14       2.91 |    100.00 


           |           Standardized values of (age2)     
    treat2 | -.3203227   -.239764  -.1566479  -.0709743   .0172566 |     Total
-----------+-------------------------------------------------------+----------
         0 |      2.86       2.94       2.84       2.66       2.41 |    100.00 
         1 |      3.78       0.54       2.70       0.00       1.62 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      2.87       2.91       2.84       2.63       2.40 |    100.00 


           |           Standardized values of (age2)     
    treat2 |   .108045   .2013908    .297294   .3957546   .4967726 |     Total
-----------+-------------------------------------------------------+----------
         0 |      2.27       2.10       2.16       2.02       1.95 |    100.00 
         1 |      0.00       1.08       1.62       0.00       1.08 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      2.24       2.09       2.16       2.00       1.94 |    100.00 


           |           Standardized values of (age2)     
    treat2 |  .6003481    .706481   .8151713    .926419   1.040224 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.95       1.93       1.78       1.81       1.94 |    100.00 
         1 |      1.08       2.16       0.54       0.54       0.54 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.94       1.93       1.76       1.80       1.92 |    100.00 


           |           Standardized values of (age2)     
    treat2 |  1.156587   1.275507   1.396984   1.521019   1.647611 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.83       1.94       1.89       1.86       1.91 |    100.00 
         1 |      1.62       0.00       0.54       0.00       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.83       1.92       1.88       1.84       1.89 |    100.00 


           |           Standardized values of (age2)     
    treat2 |  1.776761   1.908468   2.042732   2.179554   2.318933 |     Total
-----------+-------------------------------------------------------+----------
         0 |      1.96       1.84       1.88       1.69       1.92 |    100.00 
         1 |      0.00       0.00       0.00       0.00       0.00 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      1.94       1.82       1.85       1.67       1.90 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        age2 |      1226        784.74 |     717.4        431.25 |    0.80313
------------------------------------------------------------------------------

           |            Standardized values of (ed)     
    treat2 | -4.184457  -3.835109  -3.485761  -3.136414  -2.787066 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.23       0.09       0.25       0.46       0.60 |    100.00 
         1 |      0.00       0.00       0.00       0.00       2.16 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.22       0.09       0.25       0.45       0.62 |    100.00 


           |            Standardized values of (ed)     
    treat2 | -2.437718  -2.088371  -1.739023  -1.389675  -1.040328 |     Total
-----------+-------------------------------------------------------+----------
         0 |      0.69       1.41       1.74       5.33       5.13 |    100.00 
         1 |      1.62       0.54       1.08       9.73      15.14 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      0.70       1.40       1.73       5.38       5.25 |    100.00 


           |            Standardized values of (ed)     
    treat2 | -.6909802  -.3416325   .0077151   .3570628   .7064104 |     Total
-----------+-------------------------------------------------------+----------
         0 |      7.03       6.62      39.09       6.73       7.24 |    100.00 
         1 |     16.76      23.78      21.08       4.32       2.70 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |      7.15       6.82      38.89       6.71       7.19 |    100.00 


           |      Standardized values of (ed)     
    treat2 |  1.055758   1.405106   1.754453   2.103801 |     Total
-----------+--------------------------------------------+----------
         0 |      2.96       8.55       2.08       3.76 |    100.00 
         1 |      0.54       0.54       0.00       0.00 |    100.00 
-----------+--------------------------------------------+----------
     Total |      2.93       8.46       2.06       3.72 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
          ed |     12.03        2.8708 |     10.35        2.0107 |    0.67850
------------------------------------------------------------------------------

           |  Standardized values
           |    of (black)     
    treat2 |  -.322318   3.102337 |     Total
-----------+----------------------+----------
         0 |     92.65       7.35 |    100.00 
         1 |     15.68      84.32 |    100.00 
-----------+----------------------+----------
     Total |     91.77       8.23 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
       black |    .07354        .26102 |     .8432        .36456 |   -2.42775
------------------------------------------------------------------------------

           |  Standardized values
           |    of (hisp)     
    treat2 |  -.279489   3.577741 |     Total
-----------+----------------------+----------
         0 |     92.80       7.20 |    100.00 
         1 |     94.05       5.95 |    100.00 
-----------+----------------------+----------
     Total |     92.81       7.19 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        hisp |    .07204        .25856 |    .05946        .23712 |    0.05070
------------------------------------------------------------------------------

           |  Standardized values
           |   of (married)     
    treat2 | -1.516728   .6592741 |     Total
-----------+----------------------+----------
         0 |     28.83      71.17 |    100.00 
         1 |     81.08      18.92 |    100.00 
-----------+----------------------+----------
     Total |     29.42      70.58 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
     married |     .7117        .45297 |     .1892        .39272 |    1.23265
------------------------------------------------------------------------------

           |  Standardized values
           |    of (nodeg)     
    treat2 | -.6686902    1.49537 |     Total
-----------+----------------------+----------
         0 |     70.42      29.58 |    100.00 
         1 |     29.19      70.81 |    100.00 
-----------+----------------------+----------
     Total |     69.94      30.06 |    100.00 


------------------------------------------------------------------------------
             |        treat2=0         |        treat2=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
       nodeg |     .2958        .45643 |     .7081        .45587 |   -0.90381
------------------------------------------------------------------------------

. 
. *check balance of lagged dep var
. foreach var of varlist re74 re75 {
  2.         stddiff `var', by(treat)
  3. }

------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        re74 |     13826        9636.6 |      2096        4886.6 |    1.53540
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |         treat=0         |         treat=1         |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        re75 |     13453        9334.5 |      1532        3219.3 |    1.70734
------------------------------------------------------------------------------

.         
. *examine effect of treatment variable in sample
. reg re78 treat2 

      Source |       SS           df       MS      Number of obs   =    16,177
-------------+----------------------------------   F(1, 16175)     =    142.43
       Model |  1.3206e+10         1  1.3206e+10   Prob > F        =    0.0000
    Residual |  1.4997e+12    16,175    92717516   R-squared       =    0.0087
-------------+----------------------------------   Adj R-squared   =    0.0087
       Total |  1.5129e+12    16,176  93528158.7   Root MSE        =      9629

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      treat2 |  -8497.516   712.0207   -11.93   0.000    -9893.156   -7101.877
       _cons |   14846.66   76.14292   194.98   0.000     14697.41    14995.91
------------------------------------------------------------------------------

. 
. *************************************Q3**************************************
> ***
. *control for observables using CPS control group
. reg re78 treat2 `vars' re74 re75

      Source |       SS           df       MS      Number of obs   =    16,177
-------------+----------------------------------   F(10, 16166)    =   1469.49
       Model |  7.2040e+11        10  7.2040e+10   Prob > F        =    0.0000
    Residual |  7.9252e+11    16,166    49023575   R-squared       =    0.4762
-------------+----------------------------------   Adj R-squared   =    0.4758
       Total |  1.5129e+12    16,176  93528158.7   Root MSE        =    7001.7

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      treat2 |    793.587   548.2543     1.45   0.148    -281.0522    1868.226
         age |  -233.6775   41.18067    -5.67   0.000    -314.3962   -152.9588
        age2 |   1.814371   .5609947     3.23   0.001     .7147589    2.913982
          ed |   166.8492   28.65984     5.82   0.000     110.6728    223.0257
       black |  -790.6086   213.2452    -3.71   0.000    -1208.593   -372.6243
        hisp |  -175.9751   218.9913    -0.80   0.422    -605.2222     253.272
     married |    224.266   149.8454     1.50   0.135    -69.44762    517.9796
       nodeg |   311.8445   178.5174     1.75   0.081    -38.06941    661.7585
        re74 |   .2953363   .0122165    24.18   0.000     .2713906    .3192821
        re75 |   .4706353    .012161    38.70   0.000     .4467984    .4944723
       _cons |   7634.344   736.6707    10.36   0.000     6190.388      9078.3
------------------------------------------------------------------------------

. 
. ************************************Q4***************************************
> ***
. *examine income trends to check if parallel
. sum re74 if treat == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        re74 |        185    2095.574     4886.62          0   35040.07

. sum re74 if treat == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        re74 |     16,252    13826.27     9636.62          0   39570.68

. sum re75 if treat == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        re75 |        185    1532.055    3219.251          0   25142.24

. sum re75 if treat == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        re75 |     16,252    13452.69    9334.519          0   25243.55

. 
. drop if treat2 == .
(260 observations deleted)

. 
. psmatch2 treat2 `vars' re74 re75, common

Probit regression                               Number of obs     =     16,177
                                                LR chi2(9)        =    1105.79
                                                Prob > chi2       =     0.0000
Log likelihood = -458.17408                     Pseudo R2         =     0.5468

------------------------------------------------------------------------------
      treat2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .3688472   .0437743     8.43   0.000     .2830511    .4546433
        age2 |  -.0059857   .0007341    -8.15   0.000    -.0074245   -.0045469
          ed |  -.0122424   .0229324    -0.53   0.593     -.057189    .0327043
       black |   1.826743   .1063787    17.17   0.000     1.618245    2.035242
        hisp |   .6624671   .1659565     3.99   0.000     .3371983    .9877359
     married |  -.6873024    .113316    -6.07   0.000    -.9093977   -.4652071
       nodeg |   .6792456   .1364881     4.98   0.000     .4117339    .9467574
        re74 |   -.000028   .0000123    -2.27   0.023    -.0000521   -3.81e-06
        re75 |  -.0000987   .0000157    -6.30   0.000    -.0001295    -.000068
       _cons |  -7.484834   .6895371   -10.85   0.000    -8.836302   -6.133366
------------------------------------------------------------------------------
Note: 3032 failures and 0 successes completely determined.

. ren _pscore pscore

. ren _support csupport

. 
. *check common support 
. tab treat2 csupport

           |   psmatch2: Common
           |        support
    treat2 | Off suppo  On suppor |     Total
-----------+----------------------+----------
         0 |         0     15,992 |    15,992 
         1 |         6        179 |       185 
-----------+----------------------+----------
     Total |         6     16,171 |    16,177 


. 
. *check common support
. bysort treat2: sum pscore, det

-------------------------------------------------------------------------------
-> treat2 = 0

                 psmatch2: Propensity Score
-------------------------------------------------------------
      Percentiles      Smallest
 1%     9.47e-19       2.08e-21
 5%     1.26e-14       2.08e-21
10%     5.65e-12       2.08e-21       Obs              15,992
25%     2.42e-09       2.08e-21       Sum of Wgt.      15,992

50%     2.38e-06                      Mean           .0078785
                        Largest       Std. Dev.      .0415291
75%     .0008381       .6785443
90%     .0069475       .6893522       Variance       .0017247
95%     .0217886       .6985255       Skewness       8.519186
99%     .2359516       .7096074       Kurtosis       90.90878

-------------------------------------------------------------------------------
-> treat2 = 1

                 psmatch2: Propensity Score
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0008007       .0002929
 5%     .0047228       .0008007
10%     .0141319       .0008178       Obs                 185
25%     .1508836       .0010259       Sum of Wgt.         185

50%     .3113973                      Mean           .3230468
                        Largest       Std. Dev.      .2139958
75%     .4479449         .71388
90%     .6566437       .7179367       Variance       .0457942
95%     .6850162       .7209927       Skewness       .2173457
99%     .7209927       .7372084       Kurtosis       2.091492


. 
. 
. *manually calculate pscore and check common support
. probit treat2 `vars' re74 re75

Iteration 0:   log likelihood = -1011.0713  
Iteration 1:   log likelihood =  -659.0286  
Iteration 2:   log likelihood = -499.99881  
Iteration 3:   log likelihood = -462.80911  
Iteration 4:   log likelihood = -458.21853  
Iteration 5:   log likelihood = -458.17409  
Iteration 6:   log likelihood = -458.17408  

Probit regression                               Number of obs     =     16,177
                                                LR chi2(9)        =    1105.79
                                                Prob > chi2       =     0.0000
Log likelihood = -458.17408                     Pseudo R2         =     0.5468

------------------------------------------------------------------------------
      treat2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .3688472   .0437743     8.43   0.000     .2830511    .4546433
        age2 |  -.0059857   .0007341    -8.15   0.000    -.0074245   -.0045469
          ed |  -.0122424   .0229324    -0.53   0.593     -.057189    .0327043
       black |   1.826743   .1063787    17.17   0.000     1.618245    2.035242
        hisp |   .6624671   .1659565     3.99   0.000     .3371983    .9877359
     married |  -.6873024    .113316    -6.07   0.000    -.9093977   -.4652071
       nodeg |   .6792456   .1364881     4.98   0.000     .4117339    .9467574
        re74 |   -.000028   .0000123    -2.27   0.023    -.0000521   -3.81e-06
        re75 |  -.0000987   .0000157    -6.30   0.000    -.0001295    -.000068
       _cons |  -7.484834   .6895371   -10.85   0.000    -8.836302   -6.133366
------------------------------------------------------------------------------
Note: 3032 failures and 0 successes completely determined.

. predict double pscore_m
(option pr assumed; Pr(treat2))

. 
. *check common support
. bysort treat2: sum pscore_m, det

-------------------------------------------------------------------------------
-> treat2 = 0

                         Pr(treat2)
-------------------------------------------------------------
      Percentiles      Smallest
 1%     9.47e-19       2.08e-21
 5%     1.26e-14       2.08e-21
10%     5.65e-12       2.08e-21       Obs              15,992
25%     2.42e-09       2.08e-21       Sum of Wgt.      15,992

50%     2.38e-06                      Mean           .0078785
                        Largest       Std. Dev.      .0415291
75%     .0008381       .6785443
90%     .0069475       .6893522       Variance       .0017247
95%     .0217886       .6985255       Skewness       8.519186
99%     .2359516       .7096074       Kurtosis       90.90878

-------------------------------------------------------------------------------
-> treat2 = 1

                         Pr(treat2)
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0008007       .0002929
 5%     .0047228       .0008007
10%     .0141319       .0008178       Obs                 185
25%     .1508836       .0010259       Sum of Wgt.         185

50%     .3113973                      Mean           .3230468
                        Largest       Std. Dev.      .2139958
75%     .4479449         .71388
90%     .6566437       .7179367       Variance       .0457942
95%     .6850162       .7209927       Skewness       .2173457
99%     .7209927       .7372084       Kurtosis       2.091492


. 
. *graphical check
. /*
> graph twoway \\\
>         (kdensity pscore if treat2 == 1) \\\
>         (kdensity pscore if treat2 == 0 & pscore > .003)
> */
. 
. *check for common support by hand
. egen min_pscm_t = min(pscore_m) if treat2 == 1
(15992 missing values generated)

. egen min_pscm = min(min_pscm_t)

. egen max_pscm_t = max(pscore_m) if treat2 == 0
(185 missing values generated)

. egen max_pscm = max(max_pscm_t)

. 
. gen csupport_m = 1

. replace csupport_m = 0 if pscore_m < min_pscm | pscore_m > max_pscm
(11,096 real changes made)

. 
. tab csupport_m

 csupport_m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,096       68.59       68.59
          1 |      5,081       31.41      100.00
------------+-----------------------------------
      Total |     16,177      100.00

. tab csupport_m treat2

           |        treat2
csupport_m |         0          1 |     Total
-----------+----------------------+----------
         0 |    11,090          6 |    11,096 
         1 |     4,902        179 |     5,081 
-----------+----------------------+----------
     Total |    15,992        185 |    16,177 


. drop _*

. 
. ************************************Q6***************************************
> ***
. 
. *restrict sample to common support
. *keep if csupport_m == 1
. 
. 
. *propensity score matching estimation
. psmatch2 treat2 `vars' re74 re75, out(re78) ate common

Probit regression                               Number of obs     =     16,177
                                                LR chi2(9)        =    1105.79
                                                Prob > chi2       =     0.0000
Log likelihood = -458.17408                     Pseudo R2         =     0.5468

------------------------------------------------------------------------------
      treat2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .3688472   .0437743     8.43   0.000     .2830511    .4546433
        age2 |  -.0059857   .0007341    -8.15   0.000    -.0074245   -.0045469
          ed |  -.0122424   .0229324    -0.53   0.593     -.057189    .0327043
       black |   1.826743   .1063787    17.17   0.000     1.618245    2.035242
        hisp |   .6624671   .1659565     3.99   0.000     .3371983    .9877359
     married |  -.6873024    .113316    -6.07   0.000    -.9093977   -.4652071
       nodeg |   .6792456   .1364881     4.98   0.000     .4117339    .9467574
        re74 |   -.000028   .0000123    -2.27   0.023    -.0000521   -3.81e-06
        re75 |  -.0000987   .0000157    -6.30   0.000    -.0001295    -.000068
       _cons |  -7.484834   .6895371   -10.85   0.000    -8.836302   -6.133366
------------------------------------------------------------------------------
Note: 3032 failures and 0 successes completely determined.
-------------------------------------------------------------------------------
> ---------
        Variable     Sample |    Treated     Controls   Difference         S.E.
>    T-stat
----------------------------+--------------------------------------------------
> ---------
            re78  Unmatched |  6349.1435   14846.6597  -8497.51615    712.02072
>    -11.93
                        ATT | 6498.00417   5169.59934   1328.40483   971.314547
>      1.37
                        ATU | 7998.14082   9771.43439   1773.29357            .
>         .
                        ATE |                           1757.62046            .
>         .
----------------------------+--------------------------------------------------
> ---------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |    11,090      4,902 |    15,992 
   Treated |         6        179 |       185 
-----------+----------------------+----------
     Total |    11,096      5,081 |    16,177 


. 
. *examine ATE, ATT, ATU
. 
. di "------------Average Treatment Effects------------------"
------------Average Treatment Effects------------------

. di `r(ate)'
1757.6205

. 
. di "------------Average Treatment On Treat-----------------"
------------Average Treatment On Treat-----------------

. di `r(att)'
1328.4048

. 
. di "------------Average Treatment On Untreated-------------"
------------Average Treatment On Untreated-------------

. di `r(atu)'
1773.2936

. 
. 
. 
. 
. 
. *repeat using teffects pscore matching 
. teffects psmatch (re78) (treat2 `vars'), ate  pstolerance(1e-9)

Treatment-effects estimation                   Number of obs      =     16,177
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =        138
------------------------------------------------------------------------------
             |              AI Robust
        re78 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATE          |
      treat2 |
   (1 vs 0)  |  -6681.563    3870.27    -1.73   0.084    -14267.15    904.0278
------------------------------------------------------------------------------

. teffects psmatch (re78) (treat2 `vars'), atet pstolerance(1e-9)

Treatment-effects estimation                   Number of obs      =     16,177
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =        138
------------------------------------------------------------------------------
             |              AI Robust
        re78 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
      treat2 |
   (1 vs 0)  |  -3844.111   880.1469    -4.37   0.000    -5569.167   -2119.054
------------------------------------------------------------------------------

. 
. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       16,177          370
                          Treated obs   =          185          185
                          Control obs   =       15,992          185
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
              age |  -.7961833    .0108654      .4196365   1.117203
             age2 |  -.8031274    .0223465      .3020035   1.190605
               ed |  -.6785021   -.0851049      .4905163   1.256015
            black |   2.427747    .0435947      1.950622   .9240196
             hisp |  -.0506973   -.0644646      .8410938   .7994987
          married |  -1.232648   -.0136898      .7516725   .9787472
            nodeg |   .9038111   -.0118903      .9975255   1.011149
  -----------------------------------------------------------------

. tebalance summarize, baseline
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       16,177          370
                          Treated obs   =          185          185
                          Control obs   =       15,992          185
                          -----------------------------------------

  -----------------------------------------------------------------
                  |           Means                  Variances     
                  |    Control     Treated       Control    Treated
  ----------------+------------------------------------------------
              age |   33.22524    25.81622      121.9968    51.1943
             age2 |   1225.906    717.3946      615814.1     185978
               ed |   12.02751    10.34595      8.241754   4.042714
            black |   .0735368    .8432432      .0681334   .1329025
             hisp |    .072036    .0594595       .066851    .056228
          married |   .7117309    .1891892      .2051829   .1542303
            nodeg |   .2958354    .7081081      .2083299   .2078143
  -----------------------------------------------------------------

. tebalance density
note: refitting the model using the generate() option

. tebalance box
note: refitting the model using the generate() option

. 
. *****************************************************************************
> ***
. 
. 
. 
. 
. 
. cap restore not

. cap log close
